<schedule><conference><title>Capitole du Libre 2018</title><venue>ENSEEIHT, 2 rue Charles Camichel, Toulouse</venue><city>Toulouse</city><start_date>2018-11-17</start_date><end_date>2018-11-18</end_date><days_count>2</days_count></conference><day date="2018-11-17" index="1"><room name="A001" /><event id="508"><persons /><person id="416">Didier Barvaux</person><tags /><start>10:30</start><duration>00:30</duration><room>A001</room><slug>rohc-compression-dentetes-ip-udp-rtp-et-tcp</slug><title>ROHC : compression d'ent&#234;tes IP, UDP, RTP et TCP</title><subtitle /><track>Technique</track><type>conference</type><language /><description>RObust Header Compression (ROHC) est un protocole normalis&#233; par l'IETF qui permet de minimiser la bande passante utilis&#233;e par les applications sur des liaisons r&#233;seaux &#224; faible capacit&#233; ou &#224; co&#251;t &#233;lev&#233;.

ROHC compresse sans perte les ent&#234;tes r&#233;seaux des protocoles IPv4, IPv6, ESP, UDP-Lite, UDP, RTP et TCP. L'economie pour un flux VoIP classique peut monter jusqu'&#224; 65%.

La biblioth&#232;que librohc (https://rohc-lib.org/) est une impl&#233;mentation LGPL du protocole ROHC. Elle existe depuis 2008 et vise &#224; impl&#233;menter la totalit&#233; des versions 1 et 2 du protocole.

La conf&#233;rence pr&#233;sentera les principes g&#233;n&#233;raux de la compression d'ent&#234;tes r&#233;seaux, le protocole ROHC lui-m&#234;me, et plus particuli&#232;rement les derni&#232;res &#233;volutions de la biblioth&#232;que ROHC : le support de TCP, de ROHC v2 et l'am&#233;lioration des performances de traitement.</description><links /></event><event id="514"><persons /><person id="422">Martin Carton</person><tags /><start>11:00</start><duration>01:00</duration><room>A001</room><slug>introduction-a-rust-2</slug><title>Introduction &#224; Rust</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Rust est un langage cr&#233;&#233; par Mozilla Research pour &#234;tre un langage s&#251;r, concurrent et pratique. C'est un langage compil&#233;, avec peu d'overhead, qui est un rempla&#231;ant moderne &#224; des langages comme C ou C++. Son typage fort et son unique borrow checker permettent d'&#233;viter beaucoup d'erreurs typiques du C ou C++.

Cette conf&#233;rence pr&#233;sentera Rust et ses fonctionnalit&#233;s, ses avantages et inconv&#233;nients et son avenir.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2018/introduction-a-rust-2/main.pdf</link></links></event><event id="436"><persons /><person id="354">LUC CLAUSTRES</person><person id="355">Christophe Nouguier</person><tags /><start>12:00</start><duration>00:30</duration><room>A001</room><slug>un-framework-pour-construire-des-api-rest-temps-re</slug><title>Un framework pour construire des API REST et temps-r&#233;el</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Avec Feathers vous pouvez cr&#233;er des prototypes en quelques minutes et mettre des services temps-r&#233;el et des API REST en production sous quelques jours. S&#233;rieusement ! Ce qui rend Feathers si sp&#233;cial c&#8217;est son impressionnante liste de fonctionnalit&#233;s:
* Op&#233;rations CRUD via des Services, exposant des API REST ou temps-r&#233;el.
* Ind&#233;pendant du stockage avec + de 15 connecteurs &#224; des sources de donn&#233;es incluant MongoDB, Postgres, RethinkDB et S3, &#224; travers une interface de requ&#234;te unifi&#233;e.
* Usage universel: dans le navigateur ou React Native via le client Feathers et c&#244;t&#233; serveur avec Node.js.
* Ind&#233;pendant du transport via de l&#233;g&#232;res interfaces &#224; Express (protocole HTTP) ou des libraries websockets telles que Socket.io ou Primus.
* Moderne et construit pour durer sur le standard JavaScript ES6.
* Incroyable &#233;cosyst&#232;me de plugins (e.g. authentification, autorisations, mailing, scalabilit&#233;, etc.).

Nous pr&#233;sentons des cas d&#8217;usage r&#233;els de ce framework et comment l&#8217;utiliser pour d&#233;velopper des applications avec un code &#233;l&#233;gant et flexible.</description><links /></event><event id="542"><persons /><person id="441">F&#233;d&#233;ration FDN</person><tags /><start>15:00</start><duration>01:00</duration><room>A001</room><slug>federation-fdn-et-fibre-optique-bientot-la-fibre-o</slug><title>F&#233;d&#233;ration FDN et fibre optique : bient&#244;t la fibre optique pour tous ?</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>La fibre optique pour tous &#224; la maison, avec un fournisseur d'acc&#232;s &#224; Internet (FAI) respectueux de ses utilisateurs, c'est possible ?

Cette pr&#233;sentation relate les actions que la F&#233;d&#233;ration FDN entreprend pour permettre aux FAI associatifs d'op&#233;rer sur des r&#233;seaux fibre optique jusqu'&#224; l'abonn&#233; en France. Depuis un an et demi, cette initiative est port&#233;e par un petit groupe de b&#233;n&#233;voles mi-juristes mi-informaticiens. Cette belle aventure qui ne fait que commencer m&#234;le interaction avec les collectivit&#233;s locales, discussions avec l'ARCEP, d&#233;cryptage de documents techniques et administratifs, cr&#233;ation d'outils de visualisation, et actions juridiques.

Bien que n&#233;cessairement technique, la pr&#233;sentation se veut accessible au plus grand nombre et insiste sur les enjeux plut&#244;t que sur des d&#233;tails informatiques ou juridiques.</description><links /></event><event id="543"><persons /><person id="442">Ahmad Samer Wazan</person><person id="463">R&#233;mi venant</person><tags /><start>16:30</start><duration>00:30</duration><room>A001</room><slug>linux-capabilities-se-passer-des-commandes-su-et-s</slug><title>Linux capabilities : se passer des commandes su et sudo</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Nous proposons un module qui permet de se passer des commandes su et sudo. L&#8217;avantage de notre module est qu&#8217;il permet de contr&#244;ler la liste des privil&#232;ges donn&#233;s aux programmes.

Traditionnellement, l&#8217;administration des syst&#232;mes GNU/Linux repose sur l&#8217;existence d&#8217;un seul utilisateur puissant (appel&#233; super&#8208;utilisateur) qui d&#233;tient &#224; lui seul la liste compl&#232;te des privil&#232;ges du syst&#232;me. Cette vision a &#233;t&#233; critiqu&#233;e car tous les programmes ex&#233;cut&#233;s dans le contexte du super&#8208;utilisateur obtiennent beaucoup plus de privil&#232;ges qu&#8217;ils n&#8217;en ont besoin. Par exemple, tcpdump demande uniquement le privil&#232;ge cap_net_raw pour s&#8217;ex&#233;cuter. Cependant, en l&#8217;ex&#233;cutant dans le contexte de super&#8208;utilisateur, tcpdump obtient la liste compl&#232;te des privil&#232;ges du syst&#232;me. Ainsi, l&#8217;approche traditionnelle de l&#8217;administration GNU/Linux rompt le principe du moindre privil&#232;ge, qui garantit qu&#8217;un processus doit juste avoir les privil&#232;ges n&#233;cessaires pour effectuer son travail. Un attaquant pourrait exploiter les vuln&#233;rabilit&#233;s de tcpdump afin de compromettre la s&#233;curit&#233; du syst&#232;me.

Nous proposons un module que on l'appelle RAR (Root As Role) qui impl&#233;mente une approche bas&#233;e sur les r&#244;les afin de distribuer les privil&#232;ges aux utilisateurs. Notre module est livr&#233; avec un outil appel&#233; sr (switch role) qui permet aux utilisateurs de contr&#244;ler la liste des privil&#232;ges qu&#8217;ils accordent aux programmes.

Ainsi, avec notre module, les utilisateurs de GNU/Linux peuvent cesser d&#8217;utiliser les commandes sudo et su, qui ne permettent pas de contr&#244;ler la liste des privil&#232;ges &#224; donner aux programmes.

Le code (GPL&#8239;v3) et des exemples plus complets sont disponibles sur la page GitHub du projet (https://github.com/SamerW/RootAsRole)</description><links /></event><event id="434"><persons /><person id="353">Alex Marandon</person><tags /><start>17:00</start><duration>00:30</duration><room>A001</room><slug>jupyter-un-ecosysteme-qui-gagne-a-etre-connu</slug><title>Jupyter : un &#233;cosyst&#232;me qui gagne &#224; &#234;tre connu</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Jupyter est un environnement de codage interactif particuli&#232;rement adapt&#233; &#224; l'analyse de donn&#233;es. Au centre du syst&#232;me jovyen nous d&#233;couvrirons le notebook, &#224; la fois un format de document et un type d'interface. Nous verrons comment celui-ci peut dialoguer avec diff&#233;rents langages de programmation et comment il peut &#234;tre enrichi avec des composants d'interaction (widgets) et des composants de visualisation (cartes, graphiques, etc.). Nous donnerons ensuite des pistes pour mettre en place un environnement multi-utilisateur bas&#233; sur des conteneurs Docker s'ex&#233;cutant potentiellement sur un cluster. Nous verrons enfin comment ce type d&#8217;environnement  peut permettre de distribuer des analyses de donn&#233;es reproductibles.

Cette pr&#233;sentation de relativement haut niveau devrait int&#233;resser les scientifiques qui codent aussi bien que les d&#233;veloppeurs qui analysent des donn&#233;es.</description><links /></event><event id="490"><persons /><person id="402">Didier Plaindoux</person><person id="403">Alessio Coltellacci</person><tags /><start>17:30</start><duration>01:00</duration><room>A001</room><slug>acteur-un-modele-elegant-pour-le-calcul-concurrent</slug><title>Acteur, un mod&#232;le &#233;l&#233;gant pour le calcul concurrentiel et distribu&#233;</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Avec l&#8217;av&#232;nement des architectures multi-c&#339;urs, nous avons besoin de moyens pour les exploiter. G&#233;n&#233;ralement, cela se fait &#224; l'aide des threads natifs et de primitives de synchronisation qui conduisent g&#233;n&#233;ralement &#224; des solutions difficiles &#224; mettre en oeuvre et &#224; des probl&#232;mes pour appr&#233;hender le calcul.

Explorons une approche diff&#233;rente: le mod&#232;le de l'acteur, un mod&#232;le conceptuel pour traiter le calcul concurrentiel.

Par le biais de la conception d'un jeu vid&#233;o nous illustrerons:
- ce qu'est un acteur,
- les interactions entre eux sans partager la m&#233;moire,
- la communication entre acteurs dans un syst&#232;me distribu&#233; et 
- comment avoir un syst&#232;me distribu&#233; tol&#233;rant aux pannes.</description><links /></event><room name="A002" /><event id="479"><persons /><person id="391">Baptiste Mathus</person><tags /><start>10:30</start><duration>00:30</duration><room>A002</room><slug>jenkins-evergreen-ou-comment-ne-plus-se-soucier</slug><title>Jenkins Evergreen, ou comment ne plus se soucier</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Au Contributor Summit de Jenkins World 2017, Kohsuke Kawaguchi, le cr&#233;ateur de Jenkins, a challeng&#233; la communaut&#233; pour offrir une solution &#224; de nouveaux utilisateurs d'arriver &#224; construire et livrer leur logiciel avec Jenkins en moins de 5 clics et 5 minutes.

Jenkins Evergreen, https://jenkins.io/projects/evergreen/, est une distribution de Jenkins totalement nouvelle et Open Source. Elle se met &#224; jour automatiquement, et pr&#233;configure tout en fonction de l'environnement d'ex&#233;cution, afin de laisser les utilisateurs se concentrer sur le d&#233;veloppement de leur logiciel sans avoir &#224; devenir "admins Jenkins".

Je vous expliquerai comment tout cela fonctionne : comment les instances sont connect&#233;es et remontent leurs erreurs au backend afin que nous puissions pousser des correctifs, rollbacker si un probl&#232;me est d&#233;tect&#233;, le tout sans intervention utilisateur.
Nous verrons comment ce syst&#232;me, m&#234;me en version alpha, nous a d&#233;j&#224; permis d'effectuer des am&#233;liorations dans diff&#233;rents composants de Jenkins, et quel outillage a &#233;t&#233; mis en place pour que les d&#233;veloppeurs Jenkins puissent aussi r&#233;duire leur boucle de feedback.

Bien s&#251;r, vous verrez une d&#233;monstration des deux "flavors" existantes de Jenkins Evergreen, utilisant une socket Docker locale, ou s'int&#233;grant dans AWS.</description><links /></event><event id="546"><persons /><person id="445">Arthur Lutz</person><person id="446">Philippe Pepiot</person><tags /><start>11:00</start><duration>00:30</duration><room>A002</room><slug>deployer-des-applications-python-dans-un-cluster-2</slug><title>D&#233;ployer des applications python dans un cluster openshift</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Quelles   sont les particularit&#233;s et les avantages pour pouvoir livrer des   application web python dans un cluster OpenShift (qui a du Kubernetes en  dessous).

Nous verrons le m&#233;canismes suivants : 

* s2image (source to image) dans openshift : comment construire   l'application simplement avec un requirements.txt et du WSGI standard
* Comment livrer du django avec Postgresql
* Comment livrer une application CubicWeb
* Les m&#233;canismes de s&#233;curit&#233; associ&#233;s
* Les URL automatiques pour tester des contributions ou des branches nomm&#233;es
* Parall&#232;les avec repo2docker https://github.com/jupyter/repo2docker

Nous exposerons aussi les avantages et inconv&#233;nients de d&#233;ployer des applications web python sur un cluster type openshift ou kubernetes. 

https://www.openshift.org/
https://kubernetes.io/
https://github.com/openshift/source-to-image</description><links /></event><event id="468"><persons /><person id="380">Cedric Bonhomme</person><tags /><start>11:30</start><duration>00:30</duration><room>A002</room><slug>surveiller-son-infrastructure-avec-prometheus-et-g</slug><title>Surveiller son infrastructure avec Prometheus et Grafana.</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Au cours de cette pr&#233;sentation nous verrons comment surveiller ses applications en productions.

Le monitoring "traditionnel" est non adapt&#233; aux environnement containeuris&#233;s, les instances pouvants &#234;tre supprim&#233;s/redimentionn&#233;es &#224; tout moment.

Nous allons utiliser Prometheus pour surveiller une instance auto-h&#233;berg&#233;e de Gitlab, Nextcloud et en bonus PeerTube.
Prometheus est un aggr&#233;gateur de m&#233;trics avec stockage time-series et queries.

Grafana sera utilis&#233; pour dessiner les dashboards de supervisions, en utilisant les metrics collect&#233;es par Prometheus.

(*) L'infrastructure est d&#233;ploy&#233;e avec des playbooks Ansible, sur Debian 9 avec reverse proxy Nginx et Docker de pr&#233;-configur&#233;.
Les sources seront disponibles avec les slides.

La pr&#233;sentation est destin&#233;e &#224; tout ceux qui sont curieux sur l'auto-h&#233;bergement et le suivie de sa propre infrastructure. Une connaissance basique de la ligne de commande est n&#233;cessaire, connaitre Ansible et Docker est un plus mais non obligatoire pour comprendre la pr&#233;sentation.

---

**EDIT:**
Playbooks Ansible disponible sur [https://gitlab.com/sourplum/capitole-libre-2018]("https://gitlab.com/sourplum/capitole-libre-2018")</description><links /></event><event id="492"><persons /><person id="405">Antoine CAVARD</person><tags /><start>12:00</start><duration>00:30</duration><room>A002</room><slug>developper-et-tester-vos-roles-ansible-avec-la-boi</slug><title>D&#233;velopper et tester vos r&#244;les Ansible avec la bo&#238;te &#224; outils Mol&#233;cule.</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Comment faire pour d&#233;velopper et tester votre code Ansible ?
A travers cette conf&#233;rence nous allons faire un tour des diff&#233;rentes fonctionnalit&#233;s qu'offre Molecule, un assistant aux d&#233;veloppements et aux tests des r&#244;les Ansible.</description><links /></event><event id="533"><persons /><person id="433">Antoine Beyet</person><tags /><start>16:30</start><duration>01:00</duration><room>A002</room><slug>recreez-votre-docker</slug><title>Recr&#233;ez votre Docker</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Tout le monde connait Docker, mais qui en connait les m&#233;canismes ?

Au programme, une pr&#233;sentation adapt&#233;e au plus grand nombre pour d&#233;mystifier les diff&#233;rents concepts linux li&#233;s aux containers.
Et montrer via une approche it&#233;rative qu'il est possible de passer d'un simple process &#224; un environnement d'ex&#233;cution isol&#233; en seulement quelques dizaines de lignes de Golang.</description><links /></event><event id="563"><persons /><person id="457">Adrien Blind</person><person id="474">Ludovic Piot</person><person id="475">Laurent Grangeau</person><tags /><start>17:30</start><duration>01:00</duration><room>A002</room><slug>apres-kubernetes-decouvrez-les-plateformes-de-micr</slug><title>#serverless - &#128755; mettez-le en &#339;uvre dans votre entreprise et arrivez &#224; bon port</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Tout comme le Cloud IaaS avant lui, le serverless promet de faciliter le succ&#232;s de vos projets en acc&#233;l&#233;rant le Time to Market et en fluidifiant les relations entre Devs et Ops.

Mais sa mise en &#339;uvre au sein d'une entreprise reste complexe et co&#251;teuse.

Apr&#232;s 2 ans &#224; mettre en place des plateformes manag&#233;es de ce type, nous partagons nos exp&#233;riences de ce qu&#8217;il faut faire pour mettre en &#339;uvre du serverless en entreprise, en &#233;vitant les douleurs et en limitant les contraintes au maximum.

Tout d&#8217;abord l&#8217;architecture technique, avec 2 impl&#233;mentations tr&#232;s diff&#233;rentes : Kubernetes et Helm d'un c&#244;t&#233;, Clever Cloud on-premise de l'autre.

Ensuite, la mise en place et l&#8217;utilisation d&#8217;OpenFaaS framework open source de Function as a Service. Comment tester et versionner des fonctions ind&#233;pendantes. Mais aussi les probl&#233;matiques de blue/green deployment, de rolling update, d&#8217;A/B testing. Comment diagnostiquer rapidement les d&#233;pendances et les communications entre services.

Enfin, en abordant les sujets chers &#224; la production :
- vulnerability management et patch management,
- h&#233;t&#233;rog&#233;n&#233;&#239;t&#233; du parc,
- monitoring et alerting,
- gestion des stacks obsol&#232;tes, etc</description><links /></event><room name="A201" /><event id="497"><persons /><person id="407">Vincent Privat</person><tags><tag slug="lsf">LSF</tag></tags><start>10:30</start><duration>00:30</duration><room>A201</room><slug>andre-cros-import-wikimedia-dun-fonds-darchive-exc</slug><title>Andr&#233; Cros, import Wikimedia d'un fonds d'archive exceptionnel de Toulouse</title><subtitle /><track>OpenData</track><type>conference</type><language /><description>Toulouse a depuis plusieurs ann&#233;es une d&#233;marche d'ouverture et de diffusion de ses donn&#233;es culturelles, avec notamment un accord sign&#233; entre la Ville et Wikimedia France en 2010, confirm&#233; en 2013 et 2017 par deux d&#233;lib&#233;rations du Conseil Municipal qui placent "les &#339;uvres dont la Ville d&#233;tient les droits &#224; titre exclusif" sous licence Creative Commons 4.0 BY SA.

Au hasard d'un tweet des Archives de Toulouse, nous avons d&#233;couvert l'existence et la richesse du fonds "Andr&#233; Cros", contenant pr&#232;s de 7000 photographies de presse des ann&#233;es 1950 &#224; 1980 racontant l'histoire politique, &#233;conomique et sportive de la r&#233;gion Toulousaine. Apr&#232;s 4 mois de travail, le fonds a &#233;t&#233; int&#233;gralement import&#233;, class&#233;, et r&#233;utilis&#233; pour enrichir Wikipedia.

Cette pr&#233;sentation exposera rapidement la richesse du fonds, son import, l'impact qu'il a eu sur de nombreux articles Wikipedia, et les suites envisag&#233;es avec d'autres fonds.</description><links /></event><event id="417"><persons /><person id="340">Ludovic Hirlimann</person><tags /><start>11:00</start><duration>00:30</duration><room>A201</room><slug>open-data-quid</slug><title>Open data - Quid ?</title><subtitle /><track>OpenData</track><type>conference</type><language /><description>Presentation sur les donn&#233;es ouvertes, les enjeux des exemples , comment participer etc ....</description><links /></event><event id="545"><persons /><person id="444">Victor Poughon</person><tags /><start>11:30</start><duration>00:30</duration><room>A201</room><slug>depuis1958-un-modele-statistique-open-source-de-le</slug><title>Depuis1958: un mod&#232;le statistique open-source de l'&#233;lection pr&#233;sidentielle</title><subtitle /><track>OpenData</track><type>conference</type><language /><description>En 2017 j'ai cr&#233;&#233; le site depuis1958.fr, un mod&#232;le open-source du scrutin uninominal majoritaire a deux tour de l'&#233;lection pr&#233;sidentielle fran&#231;aise. Inspir&#233; du site am&#233;ricain FiveThirtyEight, il agr&#232;ge tous les sondages d'intention de vote publi&#233;s depuis le 1er Janvier de l'ann&#233;e de l'&#233;lection, et calcule la probabilit&#233; totale de victoire de chaque candidat. Je pr&#233;senterai la m&#233;thode et les id&#233;es d'am&#233;liorations pour 2022.</description><links /></event><event id="477"><persons /><person id="389">Julien Cabieces</person><tags /><start>12:00</start><duration>00:30</duration><room>A201</room><slug>machine-learning-et-donnees-ouvertes-geographiques</slug><title>Machine learning et donn&#233;es ouvertes g&#233;ographiques : exemples d'application</title><subtitle /><track>OpenData</track><type>conference</type><language /><description>A l'heure de la d&#233;mocratisation des donn&#233;es g&#233;ographiques ouvertes et compte tenu de leur volume disponible cons&#233;quent, la question de leur traitement et de leur utilisation se pose. 

Cette conf&#233;rence pr&#233;sentera le traitement de ces donn&#233;es &#224; l'aide de techniques de machine learning et de logiciels Open Source au travers de 2 exemples de projets de recherche men&#233;s au sein de la soci&#233;t&#233; Oslandia. 

Le premier exemple propose d'&#233;valuer la qualit&#233; des donn&#233;es OpenStreetMap. L'approche choisie est de classifier les contributeurs en fonction de certaines caract&#233;ristiques de leurs contributions (fr&#233;quence, type de modifications...). En associant chaque &#233;l&#233;ment de la carte &#224; la classe de ses contributeurs, on peut alors estimer la qualit&#233; de celui-ci et identifier des &#233;ventuelles zones &#224; corriger.

Le second exemple est une plateforme de pr&#233;diction d'occupation des stations de v&#233;lo en libre-service. Les villes disposant de v&#233;los en libre service (V&#233;l&#244; toulouse par exemple) mettent &#224; disposition les donn&#233;es d'utilisation de leurs diff&#233;rentes stations en quasi temps r&#233;el. Le traitement de ces donn&#233;es &#224; l'aide d'algorithmes de machine learning permet la segmentation des profils horaires d'occupation des diff&#233;rentes stations et la r&#233;alisation d'une pr&#233;diction sur la disponibilit&#233; d'un v&#233;lo.

La pr&#233;sentation s'attachera &#224; d&#233;crire simplement les concepts parfois complexes du machine learning et mettra en avant l'ensemble des logiciels Open source utilis&#233;s.</description><links /></event><event id="493"><persons /><person id="406">C&#233;dric Levieux</person><tags /><start>15:00</start><duration>01:00</duration><room>A201</room><slug>congressus-co-construction-amendements-et-particip</slug><title>Congressus : co-construction, amendements et participations</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Le Parti Pirate, parti politique qui est en partie issu du web, a cr&#233;&#233; pour ses besoins de prise de d&#233;cision et de gestion des r&#233;unions l'outil "Congressus".
Le but de la conf&#233;rence est de montrer ce que peut faire Congressus dans le contexte de la cr&#233;ation d'amendement, de texte, de co-construction et de participation.</description><links /></event><event id="423"><persons /><person id="345">Havrileck Alexandre</person><tags /><start>16:30</start><duration>01:00</duration><room>A201</room><slug>graphql-ou-lavenir-de-la-query-de-data</slug><title>GraphQL ou l&#8217;avenir de la query de data</title><subtitle /><track>Web</track><type>conference</type><language /><description>On conna&#238;t tous les API REST qui sont devenues le standard des API ces derni&#232;res ann&#233;es.
Mais GraphQL arrive en force sur ce cr&#233;neau pour proposer un rempla&#231;ant.
GraphQL est un query language cr&#233;&#233; par Facebook en 2012 et mis en Open Source en 2015.
Qu'est ce que GraphQL ? Comment peut-on travailler avec ? Quels sont les avantages et inconv&#233;nients de celui-ci ?
Bref, un voyage dans un nouveau monde !</description><links /></event><event id="446"><persons /><person id="361">genma</person><tags /><start>17:30</start><duration>00:30</duration><room>A201</room><slug>faire-de-largent-avec-le-logiciel-libre</slug><title>Faire de l'argent avec le logiciel libre?</title><subtitle /><track>Financement du Logiciel Libre</track><type>conference</type><language /><description>L'argent c'est le nerf de la guerre et le monde du logiciel libre n'y &#233;chappe pas. Du logiciel libre &#224; l'opensource, il est possible de faire de l'argent avec le logiciel libre. Que ce soit en par le don en tant qu'association, en freelance, en soci&#233;t&#233; de service, en startup, nombreuses sont les fa&#231;ons de mon&#233;tiser des connaissances et de gagner de l'argent. Est-ce tabou? Peut-on vivre du logiciel libre ? Est-ce vraiment du logiciel libre? Un ensemble de r&#233;flexions et de partage d'exp&#233;riences sur ce vaste sujet.</description><links /></event><event id="535"><persons /><person id="435">No&#235;l Mace</person><tags /><start>18:00</start><duration>00:30</duration><room>A201</room><slug>reconcilier-lesn-avec-la-communaute-et-le-logiciel</slug><title>R&#233;concilier l'ESN avec la communaut&#233; et le logiciel libre</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Historiquement, les soci&#233;t&#233; de services en d&#233;veloppement informatique se sont toujours tenues &#224; une certaine distance des communaut&#233;s et du logiciel libre. Pourtant, en &#233;tant par d&#233;finition au c&#339;ur de nombreux projets dans une tr&#232;s grande vari&#233;t&#233; de contextes, celles-ci ont bien un immense potentiel pour pousser le d&#233;veloppement informatique &#224; s'ouvrir et &#224; lib&#233;rer plus de code.

Et si cela n'&#233;tait pas une fatalit&#233; ? Et si il &#233;tait possible, pour une ESN orient&#233;e dev, de faire de l'Open Source et du soutien &#224; la communaut&#233; des &#233;l&#233;ments essentiels de son activit&#233; ?

Ce talk, en se basant sur leur mise en place &#224; SFEIR, aura pour objectif de vous pr&#233;senter les &#233;l&#233;ments essentiels permettant de faire de ces points une r&#233;alit&#233;, en particulier la mise en place d'un Open Source Program Office et d'un Developer Advocacy Program.</description><links /></event><room name="A202" /><event id="465"><persons /><person id="378">Aline Bardou</person><tags /><start>11:00</start><duration>00:30</duration><room>A202</room><slug>creer-et-financer-un-jeu-video-libre-une-nouvelle-</slug><title>Cr&#233;er et financer un jeu vid&#233;o libre, une nouvelle approche</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>RedBricks est une plateforme de gestion de communaut&#233; et de financement participatif pour le jeu vid&#233;o cr&#233;&#233;e par OtterWays. Le projet est n&#233; de la volont&#233; de cr&#233;er des jeux vid&#233;o libres dans un cadre professionnel tout en devant d&#233;velopper un mod&#232;le &#233;conomique viable. 

La plateforme repose sur deux principes fondamentaux&#160;: int&#233;grer le joueur dans le d&#233;veloppement du jeu tout en permettant au cr&#233;ateur d&#8217;obtenir un financement tout au long de sa r&#233;alisation. L&#8217;id&#233;e est d&#8217;obtenir une version jouable d&#8217;un jeu et int&#233;gralement financ&#233;e en amont. 

Dans cette pr&#233;sentation, Aline Bardou, fondatrice et g&#233;rante d&#8217;OtterWays pr&#233;sentera le fonctionnement de la plateforme ainsi que les enjeux &#233;thiques et techniques li&#233;s &#224; la non utilisation des outils intrusifs comme le javascript ou les cookies.</description><links /></event><event id="524"><persons /><person id="427">Antoine "vv221/vv222" Le Gonidec</person><tags /><start>11:30</start><duration>01:00</duration><room>A202</room><slug>playit-a-vos-jeux-2</slug><title>./play.it, &#224; vos jeux !</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>./play.it simplifie l&#8217;installation de toute une collection de jeux vid&#233;o commerciaux sur des syst&#232;mes libres, de mani&#232;re &#224; fournir une alternative &#224; ceux qui ne conservent une instance de Windows que pour les jeux vid&#233;os.</description><links /></event><event id="457"><persons /><person id="370">Nicolas Auvray</person><tags /><start>15:00</start><duration>01:00</duration><room>A202</room><slug>0-ad-un-jeu-de-strategie-libre-et-gratuit-2</slug><title>0 A.D., un jeu de strat&#233;gie libre et gratuit</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>0 A.D. est un jeu de strat&#233;gie en temps r&#233;el qui se d&#233;roule dans l'Antiquit&#233;. Prenez le contr&#244;le d'une des 13 civilisations majeures de -500 &#224; -1 av. JC. et dominez le champ de bataille face &#224; vos adversaires, contre l'ordinateur ou entre amis.
Je vous pr&#233;senterai le jeu, et vous parlerai de son d&#233;veloppement au travers des derni&#232;res nouveaut&#233;s, en particulier l'ajout d'une nouvelle civilisation et d'un syst&#232;me de t&#233;l&#233;chargement de mods.</description><links /></event><event id="519"><persons /><person id="423">Elzen</person><person id="427">Antoine "vv221/vv222" Le Gonidec</person><tags /><start>16:30</start><duration>01:00</duration><room>A202</room><slug>enjeux</slug><title>(en)jeux</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>Jouer, c'est s&#233;rieux ! Le jeu vid&#233;o est des m&#233;dias majeurs de notre &#233;poque, et, de ce fait, est li&#233; &#224; un certain nombre d'enjeux soci&#233;taux qui peuvent avoir une importante toute particuli&#232;re au sein du mouvement pour le logiciel libre.
Au cours de cette conf&#233;rence sans pr&#233;tention, nous aborderons quelques uns de ces aspects, comme la fa&#231;on dont ces jeux sont majoritairement distribu&#233;s actuellement, et la fa&#231;on dont ils influent sur notre comportement, et t&#226;cherons de montrer en quoi le dixi&#232;me art est un domaine essentiel auquel la communaut&#233; du libre a besoin de s'int&#233;resser activement.</description><links /></event><event id="459"><persons /><person id="372">YannK</person><tags /><start>17:30</start><duration>01:00</duration><room>A202</room><slug>kheynote-2018-bilan-de-lannee-passee-pour-khaganat</slug><title>Kheynote 2018 : Bilan de l&#8217;ann&#233;e pass&#233;e pour Khaganat et perspectives &#224; venir</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>Le projet Khaganat s&#8217;appuie pour son jeu sur un syst&#232;me libre de MMORPG en 3D, Ryzom Core, h&#233;rit&#233; du d&#233;veloppement du jeu Ryzom par le studio Nevrax. Bien que parfois bancal, extr&#234;mement mal document&#233; &#224; l&#8217;origine, il est un des tr&#232;s rares outils enti&#232;rement libres qui offrent une telle plateforme de jeu, avec des services robustes et versatiles et m&#234;me ses outils de cr&#233;ation. Il semblait donc important &#224; l&#8217;&#233;quipe de Khaganat de faciliter l&#8217;usage d&#8217;un tel outil libre, &#224; un moment o&#249; l&#8217;industrie du jeu vid&#233;o prend de plus en plus de place dans notre quotidien.

Il s&#8217;agit de pr&#233;senter les avanc&#233;es faites sur le projet depuis un an, que ce soit au niveau du projet global ou du d&#233;veloppement du jeu.

Le projet Khaganat : https://khaganat.net</description><links /></event><room name="A203" /><event id="504"><persons /><person id="414">Henri Hebeisen</person><tags /><start>11:00</start><duration>00:30</duration><room>A203</room><slug>ropy-builder-faites-votre-level-design-dans-blende</slug><title>Ropy builder : faites votre level design dans Blender !</title><subtitle /><track>3D</track><type>conference</type><language /><description>Dans cette conf&#233;rence, je pr&#233;sente l'addon Ropy Builder qui cr&#233;er en quelques instants des niveaux de jeux complexes que l'on peut ensuite facilement exporter vers son mteur de jeux favoris. Ropy Builder permet d'automatiser le placement et le positionnement de nombreux objets et assets et de facilement it&#233;rer avec les developpeurs et les diff&#233;rents artistes du m&#234;me &#233;quipe. 

Ropy Builder est un outils libre sous license GNU GPL 3.0.</description><links /></event><event id="499"><persons /><person id="409">Collectif RGBa</person><tags /><start>11:30</start><duration>01:00</duration><room>A203</room><slug>a-la-decouverte-de-blender-28</slug><title>A la d&#233;couverte de Blender 2.8</title><subtitle /><track>3D</track><type>conference</type><language /><description>La prochaine version de Blender, la version 2.8, proposera une r&#233;elle cassure par rapport aux versions pr&#233;c&#233;dentes (A l'image de la version 2.5 par rapport &#224; la version 2.49, pour ceux ayant connu cette &#233;poque). Elle sera disponible courant 2019, et donc en version beta lors du Capitole du Libre 2018.
Le collectif RGBa vous propose un tour d'horizon de la nouvelle interface et des nouvelles fonctionnalit&#233;s de cette version 2.8, en pr&#233;paration depuis plus d'un an maintenant.</description><links /></event><event id="443"><persons /><person id="359">Francois Grassard</person><tags /><start>15:00</start><duration>01:00</duration><room>A203</room><slug>blender-28-de-nouveaux-outils-pour-le-rendu-de-ser</slug><title>Blender 2.8 : De nouveaux outils pour le rendu de s&#233;ries et le d&#233;veloppement graphique</title><subtitle /><track>3D</track><type>conference</type><language /><description>L'arriv&#233;e de Blender 2.8 marque une nouvelle avanc&#233;e dans l'adoption de ce logiciel phare de la 3D, au niveau professionnel. De plus en plus de studios s'y int&#233;ressent et m&#234;me l'int&#232;grent dans leur flux de production, jusqu'&#224; parfois en faire la pierre angulaire de leur processus cr&#233;atif.

Les performances graphiques de cette nouvelle version permet &#224; Blender 2.8 de se positionner comme le candidat id&#233;al pour le d&#233;veloppement de s&#233;ries, voir de projets plus longs. Le nouveau moteur de rendu EEVEE permet de r&#233;duire tr&#232;s fortement les co&#251;ts de production, ainsi que le temps n&#233;cessaire au rendu des images.

Blender propose &#233;galement &#224; pr&#233;sent des outils d&#233;di&#233;s au "LookDev". Cette discipline consiste &#224; faciliter le d&#233;veloppement d'univers graphiques et de personnages. Les &#233;l&#233;ments d'&#233;clairages fournis avec Blender 2.8 permettent rapidement de v&#233;rifier qu'un &#233;l&#233;ment produit peut fonctionner dans toutes les conditions lumineuses possibles.

Nous nous concentrerons dans cette conf&#233;rence sur ces &#233;volutions graphiques, mais aborderons &#233;galement d'autres am&#233;liorations, comme le nouveau "Grease Pencil", qui pourrait permettre &#224; Blender de devenir l'outil de r&#233;f&#233;rence pour l'animation 2D.</description><links /></event><event id="483"><persons /><person id="395">Julien Duroure</person><tags /><start>16:30</start><duration>01:00</duration><room>A203</room><slug>construire-un-rig-avec-rigify</slug><title>Construire un rig avec Rigify</title><subtitle /><track>3D</track><type>conference</type><language /><description>Le rigging est souvent une &#233;tape d&#233;licate pour pour les amateurs de 3D souhaitant animer leurs cr&#233;ations.
Le syst&#232;me d'autorig Rigify, fourni avec Blender, est une solution pour faciliter ce travail. Rigify est un outil complet et modulaire et param&#233;trable,  ce qui est souvent m&#233;connu.

A travers un exemple, nous verrons les grandes fonctionnalit&#233;s de cet outil, afin de cr&#233;er un rig pour notre mod&#232;le.</description><links /></event><event id="512"><persons /><person id="420">Les Fees Sp&#233;ciales</person><tags /><start>17:30</start><duration>01:00</duration><room>A203</room><slug>making-of-du-musee-de-lodeve</slug><title>Making of du mus&#233;e de Lod&#232;ve</title><subtitle /><track>3D</track><type>conference</type><language /><description>Pour le mus&#233;e de Lod&#232;ve, nous avons cr&#233;&#233; plus d'une heure de contenus audiovisuels. Pour cela nous avons utilis&#233; Blender et Krita pour r&#233;aliser des animations et cr&#233;er des mod&#232;les pour une fabrication par CNC et impression 3D. Nous parlerons des aspects techniques de cette production et de nos r&#233;flexions sur cette exp&#233;rience avec le logiciel Libre.</description><links /></event><room name="A302" /><event id="467"><persons /><person id="379">Kevin Ottens</person><tags /><start>11:00</start><duration>00:30</duration><room>A302</room><slug>des-blobs-colores-pour-lanalyse-de-donnees-communa</slug><title>Des blobs color&#233;s pour l'analyse de donn&#233;es communautaires</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Dans cette pr&#233;sentation nous explorerons des m&#233;triques communautaires qui furent
utilis&#233;es dans la communaut&#233; KDE. Nous pr&#233;senterons bri&#232;vement le code utilis&#233;
par l'auteur de ces m&#233;triques et comment nous l'avons modernis&#233;. Cela sera aussi
l'opportunit&#233; de montrer en partie l'outillage utilis&#233; et d'expliquer pourquoi
nous ne r&#233;utilisons pas des solutions sur &#233;tag&#232;re.

Ensuite, nous donnerons notre interpr&#233;tation de certains des graphiques et m&#233;triques
produits ces derniers mois autour de plusieurs communaut&#233;s diff&#233;rentes. En effet, bien
que ces m&#233;triques soient initialement le fait de contributeurs KDE, le nouvel outillage
est aujourd'hui un projet ind&#233;pendant utilisable en dehors de KDE.

Enfin, nous expliquerons les travaux en cours et les questions que nous comptons
explorer. Il se peut que nous discutions de plans un peu fou qui iront au del&#224; de
la simple visualisation de ce qui se passe dans une communaut&#233;...

Aucun blob color&#233; n'a &#233;t&#233; bless&#233; durant la pr&#233;paration de cette pr&#233;sentation.</description><links /></event><event id="450"><persons /><person id="363">Port Benjamin</person><tags /><start>11:30</start><duration>00:30</duration><room>A302</room><slug>planificateur-de-voyage-alternative-libre-kde-itin</slug><title>Planificateur de voyage - alternative libre - KDE Itinerary</title><subtitle /><track>C++</track><type>conference</type><language /><description>Afin d'organiser au mieux ses voyages, il peut-&#234;tre interessant de centraliser l'ensemble de ses r&#233;servations (moyen de transport, logement, restaurant...) au sein d'une m&#234;me application.

Des solutions propri&#233;taires existent (TripIt, Google Trips), n&#233;anmoins ces solutions s'immiscent dans votre vie priv&#233;e, au travers de vos mails.

Afin de r&#233;pondre &#224; ce probl&#232;me KDE Itinerary propose de faire ces traitements localement afin de garantir que vos donn&#233;es ne seront transmises &#224; aucun tiers.

Au cours de cette pr&#233;sentation nous reviendrons sur l'utilit&#233; d'une telle application, son fonctionnement et les probl&#233;matiques auxquelles nous faisons face.</description><links /></event><event id="534"><persons /><person id="434">David Wagner</person><tags /><start>12:00</start><duration>00:30</duration><room>A302</room><slug>vers-des-vehicules-autonomes-surs-avec-clang-tidy</slug><title>Vers des vehicules autonomes s&#251;rs avec clang-tidy</title><subtitle /><track>C++</track><type>conference</type><language /><description>clang-tidy est un outil d'analyse statique pour la qualit&#233; et le respect de bonnes pratiques pour C et C++.

EasyMile utilise clang-tidy dans un cadre d'am&#233;lioration continue du code; nous explorerons ses capacit&#233;s avec des exemples et aborderons des th&#232;mes tel que sa mise en oeuvre pratique dans une base de code cons&#233;quente et dans le flot de travail des d&#233;veloppeurs. Nous verrons comment clang-tidy se place dans le spectre des outils de qualit&#233; de code.</description><links /></event><event id="558"><persons /><person id="453">S&#233;bastien Dinot</person><tags /><start>15:00</start><duration>01:00</duration><room>A302</room><slug>comparaison-de-gitlab-ci-et-de-jenkins-pour-les-pr</slug><title>Comparaison de Gitlab-CI et de Jenkins pour les projets en C++</title><subtitle /><track>C++</track><type>conference</type><language /><description>Si Jenkins est actuellement l'orchestrateur d'int&#233;gration continue privil&#233;gi&#233; par de nombreuses entreprises, Gitlab-CI gagne en attractivit&#233; au fil des ans et devient une s&#233;rieuse alternative &#224; Jenkins. Nous verrons les forces et faiblesses de ces deux orchestrateurs et ce qui peut conduire &#224; privil&#233;gier l'une ou l'autre des plateformes lorsqu'on d&#233;veloppe un projet en C++.</description><links /></event><event id="510"><persons /><person id="418">ARRECOT</person><tags /><start>16:30</start><duration>01:00</duration><room>A302</room><slug>introduction-au-qml-et-a-la-creation-de-composants</slug><title>Introduction au QML et &#224; la cr&#233;ation de composants</title><subtitle /><track>C++</track><type>conference</type><language /><description>Le module QML de Qt permet de mettre en place des IHM de mani&#232;re simple et efficace. C'est un langage d&#233;claratif accessible et puissant, ce type de paradigme n&#233;cessite cependant une approche particuli&#232;re et l'on peut vite &#234;tre d&#233;sorient&#233; par les nouvelles possibilit&#233;s qu'il apporte.

L'objectif de cette conf&#233;rence est d'aborder les bases du QML : le langage, les concepts, (Element, propriet&#233;, bindings, signal, handler etc..) et comment ils s'imbriquent entre eux. Une fois ce petit tour d'horizon parcouru, nous montrerons comment r&#233;utiliser tout cela pour cr&#233;er ses propres composants. Quels sont les outils dont je dispose, les bonnes pratiques &#224; avoir et comment concevoir un composant QML correctement en se posant des questions pertinentes.

Pr&#233;requis : Aucun pr&#233;requis en QML n&#233;cessaire, avoir quelques notions de programmation (h&#233;ritage, encapsulation, exposition), aucune notion C++ ne sera abord&#233;e ou tr&#232;s peu.</description><links /></event><event id="557"><persons /><person id="452">Luc Hermitte</person><tags /><start>17:30</start><duration>01:00</duration><room>A302</room><slug>etude-de-deux-regles-qualite-desuetes-dans-un-cont</slug><title>Etude de deux r&#232;gles qualit&#233; d&#233;su&#232;tes dans un contexte d'utilisation contemporaine du C++ en particulier</title><subtitle /><track>C++</track><type>conference</type><language /><description>Nous allons nous int&#233;resser &#224; deux r&#232;gles qualit&#233; qui tendent &#224; perdurer malgr&#233; leur inad&#233;quation aux langages qui &#233;voluent, et voir pourquoi elles sont rang&#233;es dans les "Non-Rules and Myths" dans le recueil de r&#232;gles "C++ Core Guidelines".

Nous traiterons d'abord de "toute variable doit &#234;tre d&#233;clar&#233;e en d&#233;but de bloc". Cela servira de pr&#233;texte pour survoler `auto`, et pour voir ce que les compilateurs peuvent faire pour nous aider en 2018.
Nous nous attarderons ensuite sur le "Single Entry, Single Exit" et ses nombreux avatars comme l'interdiction de retours multiples. Apr&#232;s un retour aux origines du SESE, nous examinerons les implications des exceptions, et les pratiques qui devraient primer aujourd'hui.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2018/etude-de-deux-regles-qualite-desuetes-dans-un-cont/20181117-capitole-libre.pdf</link></links></event><room name="A303" /><event id="410"><persons /><person id="335">Arnaud Ferraris</person><tags /><start>10:30</start><duration>01:00</duration><room>A303</room><slug>de-lidee-au-prototype-avec-le-libre</slug><title>De l'id&#233;e au prototype avec le libre</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>&#192; l'heure o&#249; les Arduino, RaspberryPi et autres offrent un acc&#232;s facilit&#233; aux cartes de d&#233;veloppement, chacun peut se lancer &#224; moindre frais dans un projet d'objet intelligent et/ou connect&#233;.

Un premier projet sera g&#233;n&#233;ralement constitu&#233; de modules "sur &#233;tag&#232;re", mais d&#232;s qu'il prendra un peu d'envergure, il sera souvent souhaitable d'int&#233;grer toute l'&#233;lectronique dans un seul et m&#234;me "shield" ou "HAT", n&#233;cessitant l'utilisation d'outils de d&#233;veloppement &#233;lectronique.
L'aspect m&#233;canique ne sera pas &#224; n&#233;gliger, tout comme le d&#233;veloppement du logiciel embarqu&#233;.

Lors de cette conf&#233;rence, nous vous pr&#233;senterons certains des outils libres disponibles pour mener &#224; bien chacune de ces taches, puis nous montrerons comment ces derniers (notamment FreeCAD, KiCAD, gcc et avr-libc), ont &#233;t&#233; utilis&#233;s lors de la r&#233;alisation d'un shield lampem&#232;tre pour Arduino.</description><links /></event><event id="486"><persons /><person id="398">Thomas Perrot</person><tags /><start>11:30</start><duration>01:00</duration><room>A303</room><slug>measured-boot-how-to-link-the-operating-system-to-</slug><title>Measured boot: how to link the operating system to the platform integrity</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>The purpose of this presentation is to explain what the measured boot is, how it works, the difference with other solution like the secure boot, the secure boot and also a little introduction to the Trusted Platform Module (TPM).                                                                                                                               Finally, I explain how this can be implemented in an embedded Linux distribution</description><links><link tag="slides">https://media.ponyconf.io/cdl-2018/measured-boot-how-to-link-the-operating-system-to-/measured_boot_ZlzK2qE.odp</link></links></event><event id="455"><persons /><person id="369">Paul Kocialkowski</person><tags /><start>15:00</start><duration>01:00</duration><room>A303</room><slug>origami-ec-vers-un-micrologiciel-libre-pour-embedd</slug><title>Origami-EC : vers un micrologiciel libre pour Embedded Controller</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Si de nombreux logiciels libres sont d&#233;velopp&#233;s pour prendre en charge le processeur principal de nos appareils num&#233;riques (en particulier au niveau du syst&#232;me et dans une moindre mesure du d&#233;marrage), de nombreux autres composants sont laiss&#233;s pour compte. Une multitude de micro-contr&#244;leurs restent en effet sous le joug de logiciels propri&#233;taires, sans alternatives libres. Si ces composants sont moins visibles, ils sont bien souvent cruciaux pour la libert&#233;, la vie priv&#233;e et la s&#233;curit&#233;.

Le projet Origami-EC s'int&#233;resse aux Embedded Controllers, qui assurent de nombreux aspects li&#233;s &#224; la gestion d'&#233;nergie et aux entr&#233;es/sorties des ordinateurs portables. Le d&#233;veloppement d'un logiciel libre pour ces composants sera pr&#233;sent&#233;, avec tous les challenges et les contraintes techniques qui lui sont associ&#233;s.</description><links /></event><event id="454"><persons /><person id="368">Nicolas Gonzalez</person><tags /><start>16:30</start><duration>00:30</duration><room>A303</room><slug>deploiement-dune-infrastructure-lorawan-tetaneutra</slug><title>Deploiement d'une infrastructure LoRaWAN Tetaneutral en libre acces sur Toulouse</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>LoRaWAN est une technologie tr&#232;s appr&#233;ci&#233; de la communaut&#233; libriste car il est possible de construire toute une infrastructure du capteur au cloud avec du logiciel et mat&#233;riel ouvert. Cette presentation fait suite a celle de l'annee derniere et presente l'etat d'avancement du projet et du deploiement des gateways dans la ville. Nous presenterons egalement comment se connecter a l'infrastructure et creer sa premiere application IoT.</description><links /></event><event id="448"><persons /><person id="362">Cedric RAVALEC</person><tags /><start>17:00</start><duration>00:30</duration><room>A303</room><slug>iot-les-gafam-embrassent-lopen-source</slug><title>IoT : les GAFAM embrassent l'Open Source</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>L'Open Source est tr&#232;s pr&#233;sent sur toute la cha&#238;ne de valeur de l'IoT. De la g&#233;n&#233;ration des donn&#233;es au travers des objets &#224; la visualisation en passant par leurs traitements et leurs l'h&#233;bergements.
Comment les GAFAM utilisent ces briques pour construire leur Plateforme IoT ?  Comment ne pas en &#234;tre d&#233;pendant ?Comment d&#233;velopper nos propres plateforme best of breed ?</description><links /></event><event id="427"><persons /><person id="348">Pierre-Jean Texier</person><tags /><start>17:30</start><duration>01:00</duration><room>A303</room><slug>mises-a-jour-logicielles-en-environnement-linux-em</slug><title>Mises &#224; jour logicielles en environnement Linux Embarqu&#233;, petit guide et tour d'horizon</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Longtemps bas&#233;es sur des solutions "maison", il existe maintenant gr&#226;ce &#224; l'&#233;volution du march&#233; de "l'IoT", des solutions open source pour r&#233;pondre &#224; la complexit&#233; qu'est la gestion des mises &#224; jour sur un syst&#232;me Linux Embarqu&#233;.

Cette conf&#233;rence commencera par pr&#233;senter les diff&#233;rentes probl&#233;matiques li&#233;es aux mises &#224; jour dans un tel environnement :
- acc&#232;s physique, 
- s&#233;curit&#233;, 
- downtime, 
- les composants &#224; mettre &#224; jour,
- les diff&#233;rentes strat&#233;gies,
- ... 

Par la suite, il sera question de faire un tour d'horizon des diff&#233;rentes solutions libres disponibles :

- Mender,
- updatehub,
- RAUC,
- SWUpdate,
- resion.io,
- libostree.

Ainsi, autour de plusieurs d&#233;monstrations sur les plateformes du march&#233; (Microchip SAMA5D27, Beaglebone et WaRP7), nous ferons une comparaison directe entre ces diff&#233;rentes solutions (avantages, inconv&#233;nients, int&#233;gration).

Ce sera l'occasion de parler des diff&#233;rents "Build Systems" comme Buildroot ou le Projet Yocto !</description><links /></event><room name="B00" /><event id="564"><persons /><person id="458">Capitole du Libre</person><tags /><start>10:00</start><duration>00:30</duration><room>B00</room><slug>bienvenue-au-capitole-du-libre-2018</slug><title>Bienvenue au Capitole du Libre 2018</title><subtitle /><track /><type>keynote</type><language /><description>Introduction des organisateurs. Informations utiles pour le week-end.</description><links /></event><event id="509"><persons /><person id="417">David Revoy</person><tags /><start>11:00</start><duration>00:30</duration><room>B00</room><slug>10-astuces-pour-la-bonne-sante-de-votre-projet-lib</slug><title>10 astuces pour la bonne sant&#233; de votre projet libre et open-source.</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Vous maintenez ou contribuez &#224; un projet Libre et Open-Source ? 
Ou peut-&#234;tre avez-vous un future projet en t&#234;te ? 
Ces vingts minutes sont pour vous ! 
Ces dix points survoleront les bonne pratiques pour cr&#233;er un projet libre et open-source en bonne sant&#233; !</description><links /></event><event id="420"><persons /><person id="343">Adrien Grassein</person><tags><tag slug="lsf">LSF</tag></tags><start>11:30</start><duration>01:00</duration><room>B00</room><slug>android-os-libre-ou-proprietaire</slug><title>Android: OS Libre ou propri&#233;taire ?</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Je vous propose de faire le tour de l'OS Android qui, m&#234;me s'il est tr&#232;s utilis&#233; &#224; travers le monde pour beaucoup d'usages, reste tr&#232;s m&#233;connu. Nous commencerons par nous int&#233;resser &#224; l'architecture m&#234;me de cet OS avant de faire un tour du c&#244;t&#233; des diff&#233;rentes distributions (ROMs) existantes. Enfin nous verrons quelles sont les licences port&#233;es par cet OS avant de conclure sur les probl&#232;mes de brevets soulev&#233;s par la cr&#233;ation d'un produit sous cet OS.</description><links /></event><event id="522"><persons /><person id="425">Tristan Nitot</person><tags><tag slug="lsf">LSF</tag></tags><start>14:00</start><duration>01:00</duration><room>B00</room><slug>services-en-ligne-comment-concilier-vie-privee-et-</slug><title>Services en ligne : comment concilier vie priv&#233;e et personnalisation</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Le num&#233;rique prend chaque jour de plus en plus de place dans nos vies. 
Mais qui en a le contr&#244;le ?  A-t-on encore une vie priv&#233;e &#224; l'heure du num&#233;rique ? 
Le logiciel libre suffit-il pour &#233;viter d'&#234;tre fliqu&#233;s ?  Que peut-on faire pour reprendre le contr&#244;le ? 
Peut-on encore se d&#233;faire de Google ? Que pr&#233;pare Qwant dans les mois &#224; venir ? 
Voil&#224; les questions qui seront abord&#233;es lors de cette pr&#233;sentation qui promet d'&#234;tre vivante et de faire r&#233;fl&#233;chir pour aller vers un num&#233;rique plus &#233;thique et plus lib&#233;rateur.</description><links /></event><event id="478"><persons /><person id="390">Sylvain Wallez</person><tags /><start>15:00</start><duration>01:00</duration><room>B00</room><slug>les-business-models-des-editeurs-open-source</slug><title>Les business models des &#233;diteurs open source</title><subtitle /><track>Financement du Logiciel Libre</track><type>conference</type><language /><description>La controverse r&#233;cente autour du changement de licence des modules Redis a mis en lumi&#232;re les tensions entre open source et &#233;conomie. Comment un &#233;diteur open source peut-il &#234;tre rentable tout en restant fid&#232;le &#224; ses origines ? Nous pr&#233;senterons les questions essentielles auxquelles doit r&#233;pondre un &#233;diteur :

- Strat&#233;gie : comment mon&#233;tiser votre produit open source ? Par le support, par une approche "open core", des services cloud, ou une combinaison des 3 ? Et comment d&#233;finir les fonctionnalit&#233;s commerciales sans s'ali&#233;ner la communaut&#233; ?
- Tiraillement : "Vous avez lev&#233; des millions en capital risque et vous avez tous ces tickets ouverts ?!?". Quand l'argent entre en jeu, la dynamique change souvent. Comment r&#233;pondre aux attentes des investisseurs tout en continuant &#224; b&#226;tir une communaut&#233; florissante ?
- Succ&#232;s : comment arbitrer entre l'open source et le succ&#232;s commercial ? Comment aligner les d&#233;cisions techniques et commerciales ?

Nous prendrons comme exemple Elastic o&#249; travaille l'orateur, &#233;diteur d'Elasticsearch, Kibana et Logstash, ainsi que d'autres soci&#233;t&#233;s comme Redis Labs, Mongo ou DataStax. Nous &#233;voquerons aussi la dynamique &#233;conomique des fondations comme Apache ou Eclipse, et l'exp&#233;rience personnelle de l'orateur qui l'a conduit &#224; devenir vice-pr&#233;sident de la Fondation Apache, et comment contribuer &#224; l'open source a chang&#233; le cours de sa carri&#232;re.</description><links /></event><event id="531"><persons /><person id="431">Nathana&#235;l</person><tags><tag slug="lsf">LSF</tag></tags><start>16:30</start><duration>01:00</duration><room>B00</room><slug>peertube-une-plateforme-de-partage-de-video-libre-</slug><title>PeerTube, une plateforme de partage de vid&#233;o libre et d&#233;centralis&#233;e</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Il est difficile aujourd&#8217;hui de construire une alternative libre &#224; YouTube, car les co&#251;ts de stockage et de bande passante seraient trop importants pour une seule et m&#234;me entit&#233;.

PeerTube est une application web d&#233;velopp&#233;e par Framasoft essayant de r&#233;pondre &#224; ces deux contraintes :

- utiliser la f&#233;d&#233;ration (via protocole ActivityPub) pour construire un index des vid&#233;os pr&#233;sentes dans le f&#233;diverse sans toutes les stocker ;
- utiliser le BitTorrent (via la biblioth&#232;que WebTorrent) pour partager la bande passante entre les utilisateurs qui regardent une m&#234;me vid&#233;o.

Le but de cette conf&#233;rence est de pr&#233;senter le projet, ses diff&#233;rents aspects techniques ainsi que les futurs d&#233;veloppements pr&#233;vus.

Plus d'infos sur : https://joinpeertube.org/</description><links /></event><event id="540"><persons /><person id="439">St&#233;phane Bortzmeyer</person><tags><tag slug="lsf">LSF</tag></tags><start>17:30</start><duration>01:00</duration><room>B00</room><slug>internet-et-droits-humains-il-y-a-vraiment-un-rapp</slug><title>Internet et droits humains, il y a vraiment un rapport ?</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Les discussions politiques au sujet de l'Internet se limitent souvent &#224; trois ou quatre GAFA, la seule chose que connaissent certains commentateurs. Pourtant, l'infrastructure de l'Internet pose &#233;galement plein de questions politiques essentielles. La technique est-elle neutre ? Est-ce que les r&#233;seaux num&#233;riques posent des probl&#232;mes politiques particuliers ? Le pair &#224; pair va t-il sauver la neutralit&#233; du r&#233;seau ? Pour la diversit&#233; linguistique, faut-il traduire les m&#233;thodes GET et POST de HTTP ? Le protocole BGP est-il de gauche ? L'Internet est-il favorable ou d&#233;favorable aux droits humains (au passage, le 10 d&#233;cembre, ce sera le 70e anniversaire de la D&#233;claration universelle des droits humains) ? 

Et toutes ces questions peuvent-elles &#234;tre expliqu&#233;es &#224; M. et Mme Michu ? L&#183;e&#183;a citoyen&#183;ne de base doit-il&#183;elle et peut-il&#183;elle comprendre l'Internet ? Ou bien est-ce inutile et impossible, et il vaut mieux laisser ces questions aux gens s&#233;rieux ?</description><links /></event><event id="566"><persons /><person id="458">Capitole du Libre</person><tags><tag slug="lsf">LSF</tag></tags><start>19:00</start><duration>01:00</duration><room>B00</room><slug>table-ronde</slug><title>Les enjeux du traitement des donn&#233;es personnelles &#224; l&#8217;&#232;re du big data</title><subtitle /><track /><type>keynote</type><language /><description>Anim&#233;e par Amaelle GUITON, journaliste &#224; Lib&#233;ration, sp&#233;cialiste du num&#233;rique avec la participation de St&#233;phane BORTZMEYER, Ing&#233;nieur &#224; l&#8217;AFNIC, sp&#233;cialiste des r&#233;seaux, Marc REES, journaliste et r&#233;dacteur en chez &#224; Next INpact, et Tristan NITOT, fondateur de Mozilla Europe et actuellement VP Advocacy (Open Source &amp; Privacy) chez Qwant</description><links /></event><room name="B006-B007" /><event id="583"><persons /><person id="467">Framasoft</person><tags /><start>11:30</start><duration>01:00</duration><room>B006-B007</room><slug>contribatelier</slug><title>Contrib'atelier</title><subtitle /><track /><type>atelier</type><language /><description>Cette ann&#233;e Framasoft et d'autres structures ont organis&#233; des Contrib'ateliers dans quelques villes en France : Lyon, Toulouse, Nancy et Paris. L'id&#233;e est de rassembler des personnes de tous horizons, n'ayant pas n&#233;cessairement un bagage technique, pour am&#233;liorer les projets libres que nous utilisons au quotidien, et en inventer de nouveaux.

https://contribateliers.frama.site/

Nous proposons un contrib'atelier qui dure pendant tout le weekend du Capitole du Libre, &#224; partir du samedi apr&#232;s-midi, profitant de la pr&#233;sence des gens qui maintiennent des logiciels libres et qui ne manqueront pas de venir ce weekend, et leur offrir un espace leur permettant d'avancer sur leur projet avec les personnes venues contribuer au libre.

Cet atelier est dans la ligne de notre campagne Contributopia, dont l'objectif est de faciliter la contribution dans tous les domaines de la cr&#233;ation.

http://contributopia.org/</description><links /></event><event id="584"><persons /><person id="467">Framasoft</person><tags /><start>14:00</start><duration>02:00</duration><room>B006-B007</room><slug>contribatelier-2</slug><title>Contrib'atelier</title><subtitle /><track /><type>atelier</type><language /><description>Cette ann&#233;e Framasoft et d'autres structures ont organis&#233; des Contrib'ateliers dans quelques villes en France : Lyon, Toulouse, Nancy et Paris. L'id&#233;e est de rassembler des personnes de tous horizons, n'ayant pas n&#233;cessairement un bagage technique, pour am&#233;liorer les projets libres que nous utilisons au quotidien, et en inventer de nouveaux.

https://contribateliers.frama.site/

Nous proposons un contrib'atelier qui dure pendant tout le weekend du Capitole du Libre, &#224; partir du samedi apr&#232;s-midi, profitant de la pr&#233;sence des gens qui maintiennent des logiciels libres et qui ne manqueront pas de venir ce weekend, et leur offrir un espace leur permettant d'avancer sur leur projet avec les personnes venues contribuer au libre.

Cet atelier est dans la ligne de notre campagne Contributopia, dont l'objectif est de faciliter la contribution dans tous les domaines de la cr&#233;ation.

http://contributopia.org/</description><links /></event><event id="585"><persons /><person id="467">Framasoft</person><tags /><start>16:30</start><duration>02:00</duration><room>B006-B007</room><slug>contribatelier-3</slug><title>Contrib'atelier</title><subtitle /><track /><type>atelier</type><language /><description>Cette ann&#233;e Framasoft et d'autres structures ont organis&#233; des Contrib'ateliers dans quelques villes en France : Lyon, Toulouse, Nancy et Paris. L'id&#233;e est de rassembler des personnes de tous horizons, n'ayant pas n&#233;cessairement un bagage technique, pour am&#233;liorer les projets libres que nous utilisons au quotidien, et en inventer de nouveaux.

https://contribateliers.frama.site/

Nous proposons un contrib'atelier qui dure pendant tout le weekend du Capitole du Libre, &#224; partir du samedi apr&#232;s-midi, profitant de la pr&#233;sence des gens qui maintiennent des logiciels libres et qui ne manqueront pas de venir ce weekend, et leur offrir un espace leur permettant d'avancer sur leur projet avec les personnes venues contribuer au libre.

Cet atelier est dans la ligne de notre campagne Contributopia, dont l'objectif est de faciliter la contribution dans tous les domaines de la cr&#233;ation.

http://contributopia.org/</description><links /></event><room name="B104" /><event id="578"><persons /><person id="458">Capitole du Libre</person><tags /><start>10:30</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-6</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><event id="579"><persons /><person id="458">Capitole du Libre</person><tags /><start>14:00</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-7</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><event id="580"><persons /><person id="458">Capitole du Libre</person><tags /><start>16:30</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-8</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><room name="B207" /><room name="B208" /><room name="B306" /><room name="B307" /><room name="B308" /><room name="C002" /><event id="555"><persons /><person id="447">Pascal Arnoux et Myriam Criquet</person><tags /><start>10:30</start><duration>00:30</duration><room>C002</room><slug>la-place-des-gull-dans-le-monde-du-libre</slug><title>La place des GULL dans le monde du Libre</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Les Groupes d&#8217;Utilisateurs de Logiciels Libres font partie du paysage du Libre.

Mais quelle est la place, l&#8217;utilit&#233; et la valeur de ces GULL dans la promotion du logiciel libre ?

Quel est leur r&#244;le ? Pourquoi et comment le joue-t-il ?

Agissent-ils en synergie, en ignorant leur &#233;cosyst&#232;me ou en conflit avec lui ?

Apr&#232;s avoir organis&#233; une journ&#233;e inter-gull, le 10 juillet 2018, aux Rencontres Mondiales du Logiciel Libre, &#224; Strasbourg, l'April, Framasoft et Montpel'libre ont d&#233;battu de ce sujet avec les GULL pr&#233;sents, avant la cr&#233;ation de la GULL Academy au courant de l'ann&#233;e 2019. Ainsi, Montpel&#8217;libre ouvre le dialogue &#224; l&#8217;ensemble des acteurs du Libre lors du Capitole du Libre du 17 et 18 novembre 2018.</description><links /></event><event id="441"><persons /><person id="358">Le Pic</person><tags /><start>11:00</start><duration>00:30</duration><room>C002</room><slug>mais-qui-sont-les-chatons</slug><title>Mais qui sont les C.H.A.T.O.N.S. ?</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Pourquoi ce dr&#244;le de nom ? Et qui sont-ils ? Ce sont des h&#233;bergeurs web de toute sorte, du particulier &#224; l'entreprise en passant par l'asso et la SCOP, qui respectent nos donn&#233;es, et utilisent des logiciels libres pour les services en ligne qu'ils proposent.

Petite conf&#233;rence qui pr&#233;sente le collectif C.H.A.T.O.N.S. et la charte &#224; laquelle r&#233;pond ses membres, ainsi que quelques membres du collectif.

Le PIC est membre de puis peu, mais existe depuis 1999 &#224; Ramonville !</description><links /></event><event id="428"><persons /><person id="349">Simon Georges</person><tags /><start>11:30</start><duration>01:00</duration><room>C002</room><slug>ethique-et-attaques-lautre-visage-du-machine-learn</slug><title>&#233;THIQUE et atTAQUES, l'autre visage du machine learning</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Si le machine learning est LE sujet &#224; la mode, de nombreux probl&#232;mes d'&#233;thique se posent, et de nombreuses attaques sont possibles. &#192; l'heure o&#249; le moindre outil (smartphone, assistant vocal, &#8230;) en est &#233;quip&#233;, cette conf&#233;rence se propose de faire un peu le tour des pr&#233;cautions &#224; prendre&#8230; ou des possibilti&#233;s simples pour d&#233;tourner les diff&#233;rents algorithmes. Cette conf&#233;rence sera illustr&#233;e de techniques issues de papiers de recherches, mais aussi d'articles en lignes pointant du doigt les d&#233;rives.</description><links /></event><event id="541"><persons /><person id="440">marc rees</person><tags><tag slug="lsf">LSF</tag></tags><start>15:00</start><duration>01:00</duration><room>C002</room><slug>les-petits-secrets-de-la-copie-privee</slug><title>Les petits secrets de la copie priv&#233;e</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Vous gravez une distribution libre sur CD ou l'enregistrez sur disque dur externe ou clef USB, mais savez-vous que ce support a &#233;t&#233; soumis &#224; une redevance, la "r&#233;mun&#233;ration pour copie priv&#233;e ?".

Au fil de cette conf&#233;rence, nous reviendrons sur les fondamentaux de ce r&#233;gime, de la d&#233;termination des bar&#232;mes &#224; leur application, en passant par la redistribution des sommes, non sans &#233;voquer ses couacs et &#233;tranget&#233;s. 

Conf&#233;rence didactique visant &#224; expliquer au plus grand nombre un dispositif qui repr&#233;sente plus de 270 millions d'euros collect&#233;s chaque ann&#233;e par les soci&#233;t&#233;s de gestion collectives. Dans une transparence toute relative.</description><links /></event><event id="438"><persons /><person id="356">m4dz</person><tags /><start>16:30</start><duration>01:00</duration><room>C002</room><slug>si-code-is-law-a-qui-incombe-lethique</slug><title>Si "Code is Law", &#224; qui incombe l'&#233;thique ?</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>&#187;  Your scientists were so preoccupied with whether or not they could, they didn't stop to think if they should.

La r&#233;volution industrielle a favoris&#233; l'essor de la production intellectuelle et de la recherche. La soci&#233;t&#233; fonce vers son futur, parfois sans trop s'attacher aux cons&#233;quences. La question n'est plus de savoir si nous pourront atteindre tel progr&#232;s technologique, mais quand. Parall&#232;lement le libre-march&#233; pousse notre &#233;conomie vers une consommation affam&#233;e de ces nouveaut&#233;s.

En 1989, la RFC 1087 &#233;dictait d&#233;j&#224; les premi&#232;res r&#232;gles d'une &#233;thique num&#233;rique. Qu'en reste-t-il, 30 ans plus tard ? En tant que d&#233;veloppeur&#183;euse, designer, responsable produit, UX&#8230; nous portons le r&#244;le de prot&#233;ger nos utilisateurs&#183;trices des d&#233;viances d'un libre-march&#233; aux abois, toujours pr&#234;t &#224; vendre plus vite nos derniers exploits &#224; celles et ceux que nous rendons avides de nos prouesses.

Comment d&#233;finir aujourd'hui cette &#233;thique des m&#233;tiers du num&#233;rique ? Qui s'interroge quotidiennement sur les cons&#233;quences du code qu'il produit ? Avec ce code, lois de nos univers num&#233;riques, ne devenons-nous pas les garant&#183;e&#183;s des libert&#233;s de chacun ? Avant que nous n'ayons franchi la limite, posons-nous s&#233;rieusement la question : o&#249; commence notre responsabilit&#233; dans la vie publique en tant qu'acteur et actrice du num&#233;rique ?</description><links /></event><event id="431"><persons /><person id="352">Denis Dordoigne</person><tags /><start>17:30</start><duration>01:00</duration><room>C002</room><slug>vers-un-smartphone-sans-gafam</slug><title>Vers un smartphone sans GAFAM</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Nous verrons comment des logiciels libres peuvent remplacer certains logiciels privateurs des smartphones android, et comment des services Chatons peuvent remplacer les services de Google.</description><links /></event><room name="C102" /><event id="577"><persons /><person id="466">Combustible</person><tags /><start>14:00</start><duration>02:00</duration><room>C102</room><slug>atelier-junior-3</slug><title>Atelier Junior</title><subtitle /><track /><type>atelier</type><language /><description>Ateliers  d'Impression 3D, de robotique, de r&#233;alit&#233; virtuelle et de montage d&#233;montage d'un ordi... qu'avec du logiciel libre.</description><links /></event><event id="576"><persons /><person id="466">Combustible</person><tags /><start>16:30</start><duration>02:00</duration><room>C102</room><slug>atelier-junior-2</slug><title>Atelier Junior</title><subtitle /><track /><type>atelier</type><language /><description>Ateliers  d'Impression 3D, de robotique, de r&#233;alit&#233; virtuelle et de montage d&#233;montage d'un ordi... qu'avec du logiciel libre.</description><links /></event><room name="Foyer &#201;tudiants" /><event id="569"><persons /><person id="458">Capitole du Libre</person><tags /><start>12:30</start><duration>01:30</duration><room>Foyer &#201;tudiants</room><slug>pause-dejeuner-3</slug><title>Pause d&#233;jeuner</title><subtitle /><track /><type>keynote</type><language /><description>Pause d&#233;jeuner</description><links /></event><event id="572"><persons /><person id="458">Capitole du Libre</person><tags /><start>16:00</start><duration>00:30</duration><room>Foyer &#201;tudiants</room><slug>pause-2</slug><title>Pause</title><subtitle /><track /><type>keynote</type><language /><description>Pause</description><links /></event><event id="571"><persons /><person id="458">Capitole du Libre</person><tags /><start>20:00</start><duration>02:00</duration><room>Foyer &#201;tudiants</room><slug>buffet-offert-par-lassociation-toulibre-2</slug><title>Buffet offert par l'association Toulibre</title><subtitle /><track /><type>keynote</type><language /><description>Buffet convivial r&#233;unissant intervenants, speakers, organisateurs et public au Foyer des Etudiants.</description><links /></event></day><day date="2018-11-18" index="2"><room name="A001" /><event id="440"><persons /><person id="357">Squeeek</person><tags /><start>10:30</start><duration>00:30</duration><room>A001</room><slug>monnaie-libre-g1-un-commun-base-sur-le-couple-bloc</slug><title>Monnaie Libre &#286;1 : un commun bas&#233; sur le couple blockchain / toile de confiance</title><subtitle /><track>Technique</track><type>conference</type><language /><description>La Monnaie Libre &#286;1, lanc&#233;e il y a un an et demi, est bas&#233;e sur des outils classiques des cryptomonnaies : blockchain, preuve de travail, chiffrement. Un des &#233;l&#233;ments cl&#233; qui en font une monnaie &#224; part est sa toile de confiance (inspir&#233;e de GPG &#224; l'origine), qui permet d'effacer ou att&#233;nuer certains d&#233;fauts des premi&#232;res cryptomonnaies.
Il en r&#233;sulte une monnaie qui n'a pas de fronti&#232;re mais qui localise les &#233;changes et cr&#233;e du lien humain : pas de sp&#233;culation, mais beaucoup d'&#233;changes &#233;conomiques r&#233;els et... de dons !</description><links /></event><event id="517"><persons /><person id="423">Elzen</person><tags /><start>11:00</start><duration>00:30</duration><room>A001</room><slug>touhy-la-roue-reinventee</slug><title>Touhy&#8239;: la roue, r&#233;invent&#233;e</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Dans le monde de la programmation, on a un adage&#8239;: ne jamais r&#233;inventer la roue. Mais au fond, pourquoi pas&#8239;? &#199;a fait maintenant un certain temps que je travaille sur Touhy, un projet d'environnement graphique, et pour &#231;a, j'ai d&#251; r&#233;inventer quelques roues. Et &#231;a a donn&#233; des trucs plut&#244;t int&#233;ressants, en fin de compte. Donc &#231;a pourrait valoir le coup que je vous en parle un peu.</description><links /></event><event id="521"><persons /><person id="424">Maxime Chevallier</person><tags /><start>11:30</start><duration>01:00</duration><room>A001</room><slug>le-reseau-sous-linux</slug><title>Le r&#233;seau sous Linux</title><subtitle /><track>Technique</track><type>conference</type><language /><description>La pile r&#233;seau impl&#233;ment&#233;e dans le noyau Linux est tr&#232;s compl&#232;te, mais aussi tr&#232;s complexe. Elle impl&#233;mente le support de la plupart des technologies et protocoles aux diff&#233;rents niveaux OSI. Cette conf&#233;rence a pour but de pr&#233;senter l'architecture interne de la pile r&#233;seau sous Linux, en nous concentrant sur les technologies Ethernet, et les couches IP.

Nous ferons un point rapide sur les diff&#233;rents blocs mat&#233;riels impliqu&#233;s dans un contr&#244;leur r&#233;seau, en voyant comment le noyau linux g&#232;re chaque composant.

Nous verrons comment interagir avec ces diff&#233;rents composants mat&#233;riels et logiciels &#224; l'aide des outils tels qu'ethtool et iproute2 (la commande 'ip'), pour comprendre comment les op&#233;rations de configuration habituelles influent sur le syst&#232;me et ainsi mieux g&#233;rer sa configuration r&#233;seau.

Cette conf&#233;rence a pour but de s'adresser &#224; tous, aussi bien les utilisateurs d&#233;butants souhaitant d&#233;mystifier la commande "ip" que les utilisateurs exp&#233;riment&#233;s souhaitant comprendre comment mieux tirer parti de leur mat&#233;riel.</description><links /></event><event id="529"><persons /><person id="430">Cl&#233;ment Aubin</person><tags /><start>14:00</start><duration>00:30</duration><room>A001</room><slug>building-a-customized-knowledge-base-in-minutes</slug><title>Building a customized knowledge base in minutes</title><subtitle /><track>Technique</track><type>conference</type><language /><description>When working in teams on a project, we often observe that people don't tend not to use very collaborative solutions for their work. Documents get scattered across multiple folders or in emails, it gets harder to distinguish an old version of a document from a new one and we miss the possibility to link documents between each others.

XWiki aims to provide a solution to this problem. Based on the concept of "wiki" : a website on which people can create pages and make links between them ; XWiki offers an actual platform that, in addition to providing every features needed for a good wiki (page history, links, hierarchy, &#8230;), allows the real creation of collaborative spaces.

This conference aims to show how XWiki can help any individual or team to build a knowledge base adapted to his needs. We will run through some of the most popular features proposed by XWiki to adapt the platform to company use cases.

The conference will be held as follows :

* Presentation of the XWiki Open Source project and the concepts behind it ;
* Demonstration of the creation of a knowledge base for a team with a specific use case ;
* Questions and answers, either on the demonstration or more broadly on the Open Source project itself.</description><links /></event><event id="430"><persons /><person id="351">Cl&#233;ment Billac</person><tags /><start>14:30</start><duration>00:30</duration><room>A001</room><slug>keepass-tips-tricks</slug><title>Keepass tips &amp; tricks</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Pr&#233;sentation de l'outil open source de gestion de mots de passe et de quelques trucs et astuces ...</description><links /></event><event id="506"><persons /><person id="415">Thierry Stoehr</person><tags /><start>15:00</start><duration>01:00</duration><room>A001</room><slug>orgmode-la-puissance-du-format-texte-pour-tout-fai</slug><title>Orgmode, la puissance du format texte pour tout faire</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Un tour d'horizon avec d&#233;monstrations en direct des diff&#233;rentes et tr&#232;s nombreuses possibilit&#233;s de Orgmode : prise de notes, cr&#233;ations et exportations de documents, tableaux, gestion des listes, calendriers, programmation... presque tout est possible avec le format texte dans Orgmode.</description><links /></event><room name="A002" /><event id="471"><persons /><person id="384">Gr&#233;gory Colpart</person><person id="385">J&#233;r&#233;my Lecour</person><tags /><start>10:30</start><duration>01:00</duration><room>A002</room><slug>plongee-sous-le-capot-des-conteneurs</slug><title>Plong&#233;e sous le capot des conteneurs</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Le concept de &#171; conteneur &#187; a &#233;t&#233; introduit en 2008 avec LXC.
Peu apr&#232;s la d&#233;mocratisation de la virtualisation, des techniques l&#233;g&#232;res d'isolation de processus introduites depuis longtemps sous Unix (chroot) sont revenues en force.
Quelles sont les technologies &#224; la base des conteneurs ?
Revenons sur les m&#233;canismes de namespaces, cgroups, copy-on-write etc.
Et comment choisir sa solution libre de conteneurs ?
Parlons de LXC qui existe toujours et permet une utilisation simple et l&#233;g&#232;re des conteneurs, de son grand fr&#232;re LXD et de Docker avec ses fonctionnalit&#233;s plus avanc&#233;es et plus complexes (API, images, layers&#8230;).
Abordons &#233;galement les outils autour des conteneurs (management, orchestration) et des enjeux (s&#233;curit&#233;, culture, workflow).</description><links /></event><event id="502"><persons /><person id="411">Coltellacci Alessio</person><person id="412">Arnaud ltearno</person><tags /><start>11:30</start><duration>01:00</duration><room>A002</room><slug>apres-docker-les-unikernels</slug><title>Apr&#232;s Docker, les Unikernels ?</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Les architectures logicielles d&#8217;aujourd&#8217;hui reposent de plus en plus sur les conteneurs et les machines virtuelles. Avec tout ce que ces outils ont apport&#233;, des probl&#232;mes perdurent : s&#233;curit&#233;, temps de d&#233;marrage, poids des images (embarqu&#233;)&#8230;

Les unikernels apportent des r&#233;ponses concr&#232;tes et les projets existants progressent dans leur maturit&#233; et leur niveau d&#8217;industrialisation.

Dans cette pr&#233;sentation, nous aborderons :

- ce qu&#8217;est un unikernel, les concepts associ&#233;s et son fonctionnement,

- leurs champs d&#8217;application et l&#8217;&#233;cosyt&#232;me,

- une d&#233;monstration,

- on s&#8217;appuiera sur la d&#233;mo pour aborder les questionnements li&#233;s &#224; cette nouvelle technologie (d&#233;buggage, profiling&#8230;).</description><links /></event><event id="553"><persons /><person id="449">PETIT Frederic</person><tags /><start>14:00</start><duration>01:00</duration><room>A002</room><slug>talk-sa-propre-couche-dabstraction-on-premise-avec</slug><title>Sa propre couche d'abstraction On-Premise avec Rancher</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>L&#8217;infrastructure &#171; programmable &#187; permet d&#8217;introduire la notion de &#171; couches d&#8217;abstraction &#187; qui change en profondeur la mani&#232;re de faire de l&#8217;IT.
Venez d&#233;couvrir comment se munir d&#8217;une telle technologie On-Premise &#224; l&#8217;aide de logiciel libre comme Rancher et comment cette nouvelle fronti&#232;re de partage offrent un terrain propice &#224; une collaboration plus fluide entre les Dev et les Ops.</description><links /></event><event id="547"><persons /><person id="445">Arthur Lutz</person><person id="446">Philippe Pepiot</person><tags /><start>15:00</start><duration>00:30</duration><room>A002</room><slug>retour-dexperience-sur-la-mise-en-place-de-deploie</slug><title>Retour d'experience sur la mise en place de d&#233;ploiement continu</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Comment effectuer une transition d'un mod&#232;le de livraison periodique &#224; un d&#233;ploiement continu. 

Retour d&#8217;exp&#233;rience sur deux projets web.

* changement d'infrastructure, par exemple utilisation de docker, docker-compose, saltstack
* outillage pour les collecte d'erreurs : sentry, centralisation des logs
* outillage pour le DX (Developer Experience) : inner source avec vagrant et docker-compose
* outillage d&#8217;int&#233;gration continue et de revue : jenkins, mercurial
* outillage de collecte de supervision et m&#233;triques : sensu, graphite, grafana et saltstack
* int&#233;gration dans un environnement cloud (AWS) 
* gestion du changement au sein des &#233;quipe de d&#233;veloppement et des habitudes du client</description><links /></event><room name="A201" /><event id="480"><persons /><person id="392">Mathieu Cinquin</person><person id="393">Vincent Varlet</person><tags /><start>10:30</start><duration>01:00</duration><room>A201</room><slug>netdata-parce-quil-y-a-des-serveurs-sous-le-cloud</slug><title>Netdata, parce qu'il y a des serveurs sous le cloud</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Le cloud et le serverless c'est bien mais il reste toujours des serveurs physiques pour que tout fonctionne... Et qui dit infrastructure dit supervision !
Netdata, bien qu'encore jeune, se montre int&#233;ressant dans le quotidien d'un SRE. Et c'est combin&#233; avec le tryptique Prometheus, TSDB et Grafana qu'il r&#233;v&#232;le tout son potentiel.
De plus sa modularit&#233; permet de superviser aussi bien une infrastructure d'entreprise que son NAS personnel.
Bref, un vrai couteau suisse !</description><links /></event><event id="437"><persons /><person id="356">m4dz</person><tags /><start>11:30</start><duration>01:00</duration><room>A201</room><slug>architecture-zero-knowledge-et-webapps-est-ce-po-2</slug><title>Architecture Zero Knowledge et Webapps : est-ce possible ?</title><subtitle /><track>Web</track><type>conference</type><language /><description>Vous connaissez le concept des architectures zero knowledge ? Il s'agit de s'assurer que de point en point, aucun interm&#233;diaire d'un service ne puisse &#234;tre capable d'acc&#233;der &#224; des informations qui ne le concernent pas. Cette architecture implique une s&#233;paration forte des permissions, des acc&#232;s, beaucoup de chiffrement, de la gestion de cl&#233;s&#8230; Elle est complexe, mais puissante, notamment dans une approche privacy by design.

Est-ce applicable dans le cadre de nos applications web ? Comment s'assurer, en s'&#233;xecutant dans le navigateur sur une couche Javascript, qu'aucun usage malicieux ne sera fait des donn&#233;es ? Challenge ou utopie ? C'est l&#224; tout l'enjeu : d&#233;couvrons ensemble si la s&#233;curisation de nos (web)apps est vraiment possible.</description><links /></event><event id="538"><persons /><person id="437">Tom Darneix</person><tags /><start>14:00</start><duration>01:00</duration><room>A201</room><slug>ethstarter-developpement-dune-application-web-de-f</slug><title>Ethstarter : D&#233;veloppement d'une application web de financement participatif utilisant l'Ethereum (Retour d'exp&#233;rience)</title><subtitle /><track>Web</track><type>conference</type><language /><description>Ce talk est un retour d'exp&#233;rience d'un projet scolaire que j'ai effectu&#233; durant ma LP D&#233;veloppement et Qualit&#233; du Logiciel de Janvier 2018 &#224; Avril 2018.

Je vais vous montrer comment on a con&#231;u ce projet de mani&#232;re Agile en utilisant Scrum, mis en place notre environnement de d&#233;veloppement et d&#233;velopp&#233; cette application web dans un contexte universitaire.

Ce talk aura pour but de vous donner l'envie de concevoir des applications utilisant une blockchain et notamment Ethereum et de vous montrer comme on a pu s'adapter &#224; divers probl&#233;matiques gr&#226;ce aux concepts de l'Agilit&#233;.</description><links /></event><event id="589"><persons /><person id="468">Fabien Lahoudere</person><tags /><start>15:00</start><duration>00:30</duration><room>A201</room><slug>reduire-le-temps-de-demarrage-avec-le-mode-falcon-</slug><title>R&#233;duire le temps de d&#233;marrage avec le mode falcon d'U-Boot</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Savez-vous que vous pouvez faire mieux que r&#233;gler le d&#233;lai de d&#233;marrage &#224; 0 pour que Uboot d&#233;marre votre noyau plus rapidement? Au cours de cette pr&#233;sentation, vous d&#233;couvrirez une mani&#232;re de r&#233;duire le temps de d&#233;marrage avec le mode falcon d'u-boot. Au-del&#224; de la fa&#231;on dont cela fonctionne, certains des avantages et inconv&#233;nients par rapport au mode de d&#233;marrage par d&#233;faut seront abord&#233;s. Enfin, Fabien expliquera comment ajouter de nouvelles fonctionnalit&#233;s.</description><links /></event><room name="A202" /><event id="472"><persons /><person id="386">Matthieu Barbet</person><person id="460">FALQUIER S&#233;bastien</person><tags /><start>10:30</start><duration>01:00</duration><room>A202</room><slug>comment-on-a-reussi-a-faire-de-lopensource</slug><title>Comment on a r&#233;ussi &#224; faire de l&#8217;opensource</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Nous proposons de vous parler de notre exp&#233;rience dans la contribution &#224; l'opensource &#224; travers notre solution ARLAS (demo.arlas.io): Ce qu'elle fait, &#224; qui elle s&#8217;adresse, pourquoi avoir fait le choix de l&#8217;open source et surtout comment nous avons relev&#233; les d&#233;fis de d&#233;veloppement pos&#233;s entre autres par l&#8217;open source.</description><links /></event><event id="528"><persons /><person id="429">Dubost Ludovic</person><tags /><start>11:30</start><duration>01:00</duration><room>A202</room><slug>lopen-source-a-gagne-vraiment-comment-peut-on-fina</slug><title>L'Open Source a gagn&#233; ! Vraiment ? Comment peut-on financer plus de logiciel libre et open source ?</title><subtitle /><track>Financement du Logiciel Libre</track><type>conference</type><language /><description>Nous entendons souvent que l'Open-Source a gagn&#233; ? Est-ce vraiment le cas ? Dans cette pr&#233;sentation, nous montrerons que si l'Open-Source est maintenant leader pour le code de beaucoup de logiciels, il y a toujours des logiciels et services qui ne sont pas disponibles sous forme de logiciels libre, dont en particulier beaucoup de services Cloud. Nos donn&#233;es sont toujours control&#233;s par des logiciels et algorithmes propri&#233;taires construits sur une grande quantit&#233; de code open-source. Pourquoi est-ce le cas et que peut faire la communaut&#233; du logiciel libre et open-source pour am&#233;liorer cette situation. Nous discuterons comment les mod&#232;les de business ouverts et le financement des logiciels libres doit &#233;voluer afin de permettre de fournir plus de code libre et open-source dans tous les domaines.</description><links /></event><event id="549"><persons /><person id="447">Pascal Arnoux et Myriam Criquet</person><tags /><start>14:00</start><duration>00:30</duration><room>A202</room><slug>logiciel-libre-et-economie-sociale-et-solidaire</slug><title>Logiciel Libre et &#201;conomie Sociale et Solidaire</title><subtitle /><track>Financement du Logiciel Libre</track><type>conference</type><language /><description>Montpel'libre agit beaucoup pour, par et avec des acteurs de l&#8217;&#201;conomie Sociale et Solidaire. 
En partageant avec eux exp&#233;riences et points de vue, elle touche du doigt les convergences de ces deux secteurs d'activit&#233;s, qui en pratique, ne communiquent pas souvent.
Pourtant, leurs actions communes peuvent &#234;tre durables : logiciel libre, culture libre, biens communs et ESS font en pratique passer l&#8217;humain au premier rang, et, pour exister, se sont dot&#233;s de savoir-faire innovants.
L&#8217;ESS et le Libre ont donc tout &#224; gagner &#224; communiquer ensemble sur ce que l&#8217;un fait avec, pour et gr&#226;ce &#224; l&#8217;autre, ainsi qu'&#224; partager r&#233;flexions, outils et actions, comme les y ont incit&#233; Richard Stallman et Euclide Mance le 15 d&#233;cembre 2012 lors de leur d&#233;claration de Curitiba.</description><links /></event><event id="562"><persons /><person id="456">Frank Taillandier</person><tags /><start>14:30</start><duration>01:00</duration><room>A202</room><slug>jam</slug><title>La hype statique ne fait que commencer !</title><subtitle /><track>Web</track><type>conference</type><language /><description>Pourquoi assiste-t-on &#224; un retour en force des sites dits statiques depuis maintenant pr&#232;s de 10 ans ?
Quelles sont les technologies actuelles qui permettent d'aborder diff&#233;remment la production, la mise en ligne et l'h&#233;bergement de sites web ? Qu'est-ce qui se cache derri&#232;re ce que certains appellent la JAMstack ? Quels sont les acteurs majeurs de ce nouveau paradigme ? 
Quels gains pour les utilisateurs finaux, les concepteurs, les contributeurs et les propri&#233;taires de sites ?
Est-ce un simple effet de mode ou un changement en profondeur de nos mani&#232;re de travailler et concevoir des sites ?

Autant de questions auxquelles se propose de r&#233;pondre cette pr&#233;sentation, qui fera le tour de l'&#233;cosyst&#232;me actuel &#224; notre disposition. Quelques exemples viendront illustrer les possibilit&#233;s qui s'offrent &#224; nous quant &#224; la cr&#233;ation de sites web performants et s&#233;curis&#233;s.</description><links /></event><room name="A203" /><event id="445"><persons /><person id="361">genma</person><tags /><start>10:30</start><duration>01:00</duration><room>A203</room><slug>la-representation-de-linformatique-dans-les-films-</slug><title>La repr&#233;sentation de l'informatique dans les films des ann&#233;es 70 &#224; nos jours</title><subtitle /><track>WTF</track><type>conference</type><language /><description>Dans quel film a-t-on de l'informatique, quel usage, quel fantasme ou r&#233;alisme a-t-on autour de ces technologies. 
Un parcours geek des films cultes aux nanards, totalement subjective et non exhaustive, pour passer un bon moment ensemble.</description><links /></event><event id="442"><persons /><person id="359">Francois Grassard</person><tags /><start>11:30</start><duration>01:00</duration><room>A203</room><slug>meshroom-creez-des-objets-3d-a-partir-de-photos-gr</slug><title>Meshroom : cr&#233;ez des objets 3D &#224; partir de photos, gr&#226;ce &#224; une solution libre pour la photogramm&#233;trie</title><subtitle /><track>3D</track><type>conference</type><language /><description>Utiliser dans des domaines aussi divers que les effets visuels, l'architecture, l'arch&#233;ologie, l'analyse de sc&#232;nes de crime ou encore la reconstitution de visages historiques, la photogramm&#233;trie s'immisce partout dans notre soci&#233;t&#233;.

Elle consiste &#224; extraire d'un lot de photos d&#233;sordonn&#233;es, un ensemble d'&#233;l&#233;ments permettant la reconstitution d'une sc&#232;ne compl&#232;te en 3D, avec un niveau de d&#233;tails extr&#234;mement &#233;lev&#233;.

Jusqu'alors r&#233;serv&#233; aux professionnels, avec le logiciel Photoscan par exemple, le monde du libre disposait toute de m&#234;me de quelques solutions plus ou moins efficaces, tel que Bundler. L'arriv&#233;e de Meshroom permet de rendre la pratique de la photogramm&#233;trie beaucoup plus accessible et surtout beaucoup plus efficace en terme qualitatif.

Issu du monde des effets visuels, il a &#233;t&#233; &#233;prouv&#233; en production et permet d'obtenir des mod&#232;les d'un niveau de d&#233;tails qui pourrait en surprendre plus d'un, y compris chez les personnes utilisant d&#233;j&#224; des solutions non-libres.

Mais au-del&#224; de son utilisation en milieu professionnel, nous verrons comment Meshroom peut &#233;galement servir dans la vie tous les jours, via une utilisation conjointe avec Blender et une imprimante 3D. Vous pourrez ainsi r&#233;parer des objets comme le couvercle d'une jarre &#224; cookies bris&#233;e ou encore le m&#233;canisme une chasse d'eau !

Vous pourrez d&#233;couvrir lors de cette conf&#233;rence, l&#8217;&#233;tendue des possibilit&#233;s de cette application qui r&#233;volutionne les pratiques des artistes et des makers.</description><links /></event><event id="527"><persons /><person id="429">Dubost Ludovic</person><tags /><start>14:00</start><duration>01:00</duration><room>A203</room><slug>la-collaboration-avec-chiffrement-bout-en-bout-ces</slug><title>La collaboration avec chiffrement bout-en-bout, c'est possible avec CryptPad !</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Les services Cloud sont de plus en plus utilis&#233;s et vos donn&#233;es sont de plus en plus expos&#233;es. M&#234;me si les services Clouds "promettent" d'assurer la s&#233;curit&#233; de vos donn&#233;es, nous ne contr&#244;lons pas effectivement ce qui est mis en place pour assurer la s&#233;curit&#233; de nos donn&#233;es et notre vie priv&#233;e. De nombreux services cloud utilisent nos donn&#233;es pour mettre en place des business models bas&#233;s sur la publicit&#233; qui lisent nos donn&#233;es et les transf&#232;rent &#224; des services publicitaires. Dans cette pr&#233;sentation, nous voulons pr&#233;senter pourquoi une nouvelle approche est n&#233;cessaire pour les logiciels et services de collaboration, bas&#233; sur du chiffrement de bout en bout et le zero-knowledge par le service cloud. Nous pr&#233;senterons cette approche mise en oeuvre dans le projet libre CryptPad (https://cryptpad.fr) et expliquerons les progr&#232;s r&#233;alis&#233;s.</description><links /></event><event id="414"><persons /><person id="339">PulkoMandy</person><tags /><start>15:00</start><duration>00:30</duration><room>A203</room><slug>quoi-de-neuf-dans-haiku</slug><title>Quoi de neuf dans Haiku?</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Les choses ont pas mal boug&#233; cette ann&#233;e pour Haiku. Faisons le point sur les grandes avanc&#233;es de l'ann&#233;e. De nouvelles applications, un meilleur support du mat&#233;riel, de la s&#233;curit&#233;, et encore plein d'autres choses.</description><links /></event><room name="A302" /><event id="433"><persons /><person id="352">Denis Dordoigne</person><tags /><start>10:30</start><duration>01:00</duration><room>A302</room><slug>chacun-peut-et-doit-produire-du-libre</slug><title>Chacun peut comprendre et doit produire du libre</title><subtitle /><track>OpenData</track><type>conference</type><language /><description>Le libre ce n'est pas seulement du logiciel, les projets de la fondation wikimedia en sont la plus belle d&#233;monstration. Nous commencerons par expliquer ce qu'est une licence libre et comment les utiliser. Puis, puisque nous sommes tous amen&#233;s &#224; produire des documents, des id&#233;es, des paroles, etc., nous verrons quel peut &#234;tre l'int&#233;r&#234;t de distribuer tout cela sous une licence libre, m&#234;me et surtout si on pense que c'est inutile. Nous verrons &#233;galement pourquoi les licences prohibant un usage commercial sont n&#233;fastes &#224; la diffusion de la connaissance.</description><links /></event><event id="444"><persons /><person id="360">Jonas Gouraud</person><tags /><start>11:30</start><duration>00:30</duration><room>A302</room><slug>science-ouverte-contre-business-des-publications</slug><title>Science ouverte contre business des publications</title><subtitle /><track /><type>conference</type><language /><description>Mon entr&#233;e en th&#232;se m'a fait d&#233;couvrir le monde de la recherche acad&#233;mique, tout &#224; fait inconnu pour moi auparavant. J'ai pu y d&#233;couvrir les relations entre chercheurs, les moyens pour &#233;changer ses d&#233;couvertes et l'immense accumulation de connaissance qui existe d&#233;j&#224;.

Mais j'ai aussi d&#233;couvert le march&#233; des publications : les chercheurs, pay&#233;s par les Etats, fournissent gratuitement leurs r&#233;sultats &#224; des revues qui se chargent de les distribuer moyennant un droit de lecture. Cette d&#233;marche est primordiale pour les chercheurs qui y voient un moyen d'&#234;tre connu pour leurs travaux. Malheureusement, aujourd'hui, ces entreprises font une marge de plus de 40% gr&#226;ce &#224; la num&#233;risation des contenus, sans que le co&#251;t d'acc&#232;s aux connaissances pour les chercheurs (et donc pour les Etats) ne soit r&#233;duit. Ce cercle vicieux est pourtant un probl&#232;me pour la recherche dans son ensemble. A titre d'exemple, l'ensemble des universit&#233;s de Nouvelle Z&#233;lande d&#233;pensent pr&#232;s de 15 millions de dollars par an pour avoir acc&#232;s &#224; seulement 4 maisons de publication. Des universit&#233;s plus modestes de pays en d&#233;veloppement ne peuvent pas se permettre de tels co&#251;ts.

Certaines pratiques ont vu le jour pour contourner ce probl&#232;me. La publication en "open access" co&#251;te &#224; celui qui veut publier, pour &#234;tre ensuite gratuite &#224; tout lecteur. N&#233;anmoins le co&#251;t pouvant avoisinner 2500&#8364; d&#233;courage beaucoup de laboratoires. De mani&#232;re plus forte, l'Union Europ&#233;enne oblige aujourd'hui toute publication ayant utilis&#233; des fonds europ&#233;ens &#224; &#234;tre disponible gratuitement sur internet.

Il reste beaucoup &#224; faire pour une science ouverte &#224; tous. Le savoir de l'humanit&#233; ne doit pas &#234;tre d&#233;tenu comme object commercial par une minorit&#233; d'entreprises.</description><links /></event><event id="489"><persons /><person id="401">Delphine Malassingne</person><tags /><start>12:00</start><duration>00:30</duration><room>A302</room><slug>creation-artistique-et-monde-du-libre</slug><title>Cr&#233;ation artistique et monde du Libre</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Proposition de r&#233;flexion autour d'un domaine plut&#244;t trait&#233; &#224; l'encontre du libre traditionnellement : la cr&#233;ation artistique.
Comment concilier mes valeurs de partage avec la volont&#233; de prot&#233;ger ce que je cr&#233;e &#224; titre tr&#232;s personnel ? Dois-je partager ? mettre une licence ? La loi me prot&#232;ge-t-elle malgr&#233; moi ?</description><links /></event><event id="496"><persons /><person id="407">Vincent Privat</person><tags /><start>14:00</start><duration>01:00</duration><room>A302</room><slug>josm-lediteur-java-dopenstreetmap</slug><title>JOSM, l'&#233;diteur Java d'OpenStreetMap</title><subtitle /><track>OpenData</track><type>conference</type><language /><description>OpenStreetMap (OSM) est une carte du monde entier, librement modifiable, faite par des gens comme vous.

Les premi&#232;res contributions se font g&#233;n&#233;ralement via l'&#233;diteur en ligne du site web, avant de basculer vers un &#233;diteur beaucoup plus avanc&#233; et personnalisable: JOSM.

L&#8217;expos&#233; pr&#233;sentera l&#8217;histoire de JOSM, ses principales fonctionnalit&#233;s, les particularit&#233;s du projet, son int&#233;gration au sein des communaut&#233;s OSM et Java, la richesse de son &#233;cosyst&#232;me et ses perspectives de d&#233;veloppement dans les ann&#233;es &#224; venir.</description><links /></event><event id="484"><persons /><person id="396">Beno&#238;t LANUSSE</person><tags /><start>15:00</start><duration>01:00</duration><room>A302</room><slug>donner-vie-au-rer-toulousain-avec-des-logiciels-li</slug><title>Donner vie au RER toulousain avec des logiciels libres</title><subtitle /><track>OpenData</track><type>conference</type><language /><description>Avec le projet "Rallumons l'&#233;toile !", notre objectif est de d&#233;montrer l'opportunit&#233; et la faisabilit&#233; d'un RER toulousain pour &#233;viter l'asphyxie de la m&#233;tropole et am&#233;liorer la vie de ses habitants.
Une vid&#233;o pour comprendre le projet : https://rallumonsletoile.fr/2018/06/28/rer-toulousain-un-reve-a-portee-de-main/

Comme premier pas d&#233;monstratif, nous proposons de cadencer toutes les heures une ligne entre Castelnau d'Estr&#233;tefond (Nord de Toulouse) et Bazi&#232;ge (Sud-Est). Pour appuyer cette id&#233;e, nous affr&#233;tons un "train inaugural", ouvert &#224; tous, le 15 d&#233;cembre (www.facebook.com/events/287293445220872/) et nous lan&#231;ons un programme d'&#233;tudes.

Dans ce dernier, nous souhaitons cr&#233;er un comparateur de d&#233;placements entre aujourd'hui et demain. Nous l'utiliserons pour mesurer l'impact possible de la nouvelle ligne cadenc&#233;e et de ses projets connexes (nouveau r&#233;sseau de bus, am&#233;nagements pi&#233;tons et cycles). Ceci permettra en effet au grand public de mesurer les changements potentiels sur sa vie quotidienne, ce qui est difficile d'habitude pour de tel projet. Ce comparateur pourra &#234;tre utilis&#233; pour d'autres projets &#224; Toulouse (exemple : troisi&#232;me ligne de m&#233;tro) ou ailleurs.

Nos premiers essais : https://www.dropbox.com/s/1t028n0k5tp1jar/Comparateur%20-%20Premiers%20essais%20-%20V2.pdf?dl=0

Ce projet se baserait sur une grande palette de logiciels libres :
- Openstreetmap : pour am&#233;liorer la description des gares et de leurs environs (fait sur le Transilien)
- QGIS pour rajouter les am&#233;nagements envisag&#233;s
- Chouette pour cr&#233;er les jeux de donn&#233;es des horaires futurs des trains et des bus,
- Open Trip Planner ou Navitia, en cr&#233;ant une nouvelle interface pour comparer les d&#233;placements.

Nous sommes &#224; la recherche de personnes et de partenaires qui souhaiteraient contribuer &#224; la r&#233;ussite de ce projet.</description><links /></event><room name="A303" /><event id="552"><persons /><person id="448">Philippe Coval</person><tags /><start>10:30</start><duration>01:00</duration><room>A303</room><slug>build-privacy-by-design-webthings-with-iotjs-on-ti</slug><title>Webthings using IoT.js and Tizen:RT on ARTIK boards</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Mozilla IoT Webthing project is providing a framework and tools to deploy your own connected things local network. Many technologies are available to build the WebOfThings, a couple will be presented based on previous experiences such as IoT.js the IoT framework using javascript on Tizen:RT OS for micro controllers, and more.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2018/build-privacy-by-design-webthings-with-iotjs-on-ti/webthing-iotjs-20180621rzr.gif</link></links></event><event id="447"><persons /><person id="362">Cedric RAVALEC</person><tags /><start>11:30</start><duration>00:30</duration><room>A303</room><slug>strategie-de-google-pour-un-os-open-source-le-cas-</slug><title>Strat&#233;gie de Google pour un OS Open Source : Le cas Android AOSP/ Chromium OS / Fuchsia OS</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Apr&#232;s plus de 10 ans Linux n'a pas perc&#233; le monde du descktop. Il a par contre conquis le monde du mobile avec son demi-fr&#232;re Android ! 
Avec l&#8217;av&#232;nement du SaaS et du du mobile web dans les prochaines ann&#233;e les OS Open Source vont revenir en force et Google sera de la partie. Je vais vous pr&#233;senter leur strat&#233;gie et leur vision sur le desktop et le mobile.</description><links /></event><event id="425"><persons /><person id="347">Julien Tixador, fabmanager du F@bRiquet</person><tags /><start>12:00</start><duration>00:30</duration><room>A303</room><slug>unibot-outil-de-programmation-par-blocs-pour-lide-</slug><title>Unibot : outil de programmation par blocs pour l'IDE Arduino</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>UniBot est un plugin pour l'IDE Arduino d&#233;velopp&#233; par Julien Tixador, fabmanager du fablab Le F@bRiquet. Il permet de g&#233;n&#233;rer des programmes en C/C++ via une interface mettant &#224; disposition des blocs. Une fois agenc&#233;s, ces blocs constituent le programme &#224; t&#233;l&#233;verser sur la carte microcontroleur (Atmel, teensy, stm32...). Quelle diff&#233;rence par rapport &#224; d'autres programmes type "blocs" ? Il int&#232;gre la notion d'objet. UniBot peut utiliser n'importe quelle classe C/C++ via son gestionnaire de librairies. Le programme g&#233;n&#232;re automatiquement les blocs correspondant aux librairies appel&#233;es (Arduino ou homemade).

Vous pouvez sauvegarder vos projets blocs ainsi que le code source g&#233;n&#233;r&#233; afin de le r&#233;utiliser &#224; volont&#233; dans votre &#233;diteur pr&#233;f&#233;r&#233;. Finis les erreurs de compilation &#224; cause du point virgule, la programmation graphique et p&#233;dagogique par bloc vous permet de coder sans vous souciez de la syntaxe. Faire coder nos enfants n'a jamais &#233;t&#233; aussi simple ! 

A vos blocs, pr&#234;t, codez !</description><links /></event><event id="462"><persons /><person id="375">Projet Afrikalan - Association Bilou Toguna</person><tags /><start>14:00</start><duration>00:30</duration><room>A303</room><slug>en-quoi-les-logiciels-libres-educatifs-peuvent-ils</slug><title>Afrikalan, ou pourquoi les pinguins devraient plus souvent aller dans les &#233;coles d'Afrique...</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Dans beaucoup de pays d'Afrique et de pays dits "du sud" de mani&#232;re g&#233;n&#233;rale le syst&#232;me &#233;ducatif doit faire face &#224; de grandes difficult&#233;s: &#233;coles surcharg&#233;es, &#233;chec scolaire important. Les logiciels &#233;ducatifs peuvent vraiment amener quelque chose aux enfants en offrant des outils permettant de renforcer les apprentissages faits &#224; l'&#233;cole. Il faut toutefois tenir compte de certaines probl&#233;matiques: &#233;lectricit&#233; et internet pas toujours disponibles, ordinateurs et p&#233;dagogie num&#233;rique peu d&#233;mocratis&#233;s, etc...

Or, les logiciels &#233;ducatifs sont souvent pens&#233;s pour les enfants des pays dit "du nord". Il peuvent &#234;tre moins "parlants" aux enfants dans d'autres contextes, ou ne pas &#234;tre adapt&#233;s &#224; certaines contraintes techniques (absence d'internet par exemple). Hors des pays "du nord", les logiciels privatifs, qui interdisent toute modification, condamnent souvent leurs utilisateurs &#224; devoir utiliser des solutions inadapt&#233;es.

Le projet Afrikalan tire partie de la libert&#233; d'adaptation des logiciels open-source, afin de tenter d'apporter des solutions adapt&#233;es &#224; d'autres terrains. Cela se fait en construisant de petits ordinateurs &#233;ducatifs destin&#233;s &#224; &#234;tre donn&#233;s &#224; diff&#233;rents lieux accueillant les enfants au Mali et ailleurs: biblioth&#232;ques scolaires, centres d'animation culturelle, centres d'accueil, etc...

Ces appareils qui embarquent diff&#233;rentes ressources &#233;ducatives libres (jeux &#233;ducatifs, encyclop&#233;dies...) sont con&#231;us pour travailler de mani&#232;re autonome (sans internet), consommer peu d'&#233;lectricit&#233;, &#234;tre d'un usage le plus simple possible, et r&#233;sister aux "d&#233;r&#233;glages". Ils permettent &#233;galement de transf&#233;rer facilement ce contenu &#233;ducatif vers des smartphones (qui, contrairement aux ordinateurs, sont tr&#232;s d&#233;mocratis&#233;s en Afrique). Enfin un effort a &#233;t&#233; fait pour que les enfants retrouvent dans les appareils des sc&#232;nes de leur vie quotidienne et certaines application ont &#233;t&#233; traduites dans la langue maternelle des enfants.

En partant de cette exp&#233;rience, on abordera les questions auxquelles on peut faire face lorsqu'on diffuse des outils de p&#233;dagogie num&#233;rique dans un tel contexte, et quelques pistes envisag&#233;es. 

C'est une occasion suppl&#233;mentaire de constater combien l'utilisation des logiciels libres est un atout consid&#233;rable&#160;: En plus de permettre une diffusion sans restriction du contenu &#233;ducatif, leur capacit&#233; d'adaptation leur permet d'aller l&#224; o&#249; des solutions privatives se passeraient pas.</description><links /></event><event id="473"><persons /><person id="387">Ma&#239;tan&#233; Lenoir</person><tags /><start>14:30</start><duration>01:00</duration><room>A303</room><slug>designers-accueillez-les-tous</slug><title>Designers : Accueillez-les tous !</title><subtitle /><track /><type>conference</type><language /><description>Le designer-contributeur au logiciel libre est comme une l&#233;gende. Certains en ont entendu parler, il paraitrait m&#234;me que des d&#233;veloppeuses ont collabor&#233; avec eux. Pourtant, les projets libres peinent toujours autant &#224; en accueillir. O&#249; sont ces designers ? Pourquoi restent-ils cach&#233;s ? Et au fait, c'est quoi un designer ? Est-ce que &#231;a s'apprivoise ?

Je vous emm&#232;ne faire un tour dans le monde des designers, histoire de comprendre pourquoi on en voit si peu et, surtout, comment faire pour en accueillir davantage dans vos projets libres !</description><links /></event><room name="B00" /><event id="476"><persons /><person id="388">Bruno Coudoin</person><tags /><start>10:30</start><duration>01:00</duration><room>B00</room><slug>contribuer-a-openstreetmap-avec-des-photos-de-rue</slug><title>Contribuer &#224; OpenStreetMap avec des photos de rue</title><subtitle /><track>OpenData</track><type>conference</type><language /><description>OpenStreetMap (OSM) est un projet de cartographie qui a pour but de constituer une base de donn&#233;es g&#233;ographiques libre du monde (permettant par exemple de cr&#233;er des cartes sous licence libre), en utilisant le syst&#232;me GPS et d'autres donn&#233;es libres.

A l'origine, OSM consistait &#224; cr&#233;er une carte agr&#233;able &#224; regarder et pr&#233;cise. Aujourd'hui diff&#233;rents acteurs poussent OSM vers d'autres domaines comme le calcul d'itin&#233;raire ou la navigation.
 
Pour ces nouveaux domaines, les traces GPS et les photographies a&#233;riennes ne sont pas suffisantes. Ils devient indispensable d'avoir des photos de rues afin de prendre en compte les limitations de vitesse, les restrictions, les num&#233;ro de sortie d'autoroute, ...

Deux projets sortent du lot dans ce domaine, OpenStreetCam et Mapillary. Nous verrons dans cette conf&#233;rence comment il est simple de contribuer &#224; OSM en prenant vous m&#234;me des photos de rue avec un t&#233;l&#233;phone portable. Nous terminerons sur une d&#233;monstration montrant comment utiliser ces nouvelles informations au niveau de l'&#233;dition d'OpenStreetMap.</description><links /></event><event id="464"><persons /><person id="377">Pierre-Yves Gosset</person><tags /><start>11:30</start><duration>01:00</duration><room>B00</room><slug>degooglisons-internet-on-fait-lbilan-calmement</slug><title>D&#233;googlisons internet : On fait l'bilan, calmement.</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Au Capitole du Libre 2014, Framasoft annon&#231;ait sa volont&#233; de vouloir agir contre les GAFAM (Google, Apple, Facebook, Amazon, Microsoft). D'octobre 2014 &#224; octobre 2017, l'association a donc men&#233;e la campagne "D&#233;googlisons Internet". Cela s'est traduit par une sorte d'escalade de l'Himalaya, mais en tongs. Quels &#233;taient les enjeux essentiels ? Comment s'y prendre ? Quelle(s) route(s) suivre ? Comment sortir 10 services grands publics par an ? Comment financer une telle exp&#233;dition ? Avec quels moyens humains ? Et si on atteignait le sommet... comment redescendre ?

Cette conf&#233;rence, qui prendra le temps de rappeler les enjeux, s'attachera &#224; lever un coin de voile sur une campagne plut&#244;t r&#233;ussie, mais men&#233;e de fa&#231;on tr&#232;s empirique. Enfin, nous essaierons, ensemble, d'en faire le bilan.</description><links /></event><event id="416"><persons /><person id="340">Ludovic Hirlimann</person><tags /><start>13:30</start><duration>01:00</duration><room>B00</room><slug>pgp-key-signing-party</slug><title>PGP key signing party</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>atelier</type><language /><description>A 20 minute session to sign keys. You need to register before hand to boost participation and make things easier. Instructions on how to register are at https://2018.capitoledulibre.org/key-signing-party/</description><links /></event><event id="466"><persons /><person id="377">Pierre-Yves Gosset</person><tags /><start>14:30</start><duration>01:00</duration><room>B00</room><slug>contributopia-peut-on-faire-du-libre-sans-vision-p</slug><title>Contributopia : Peut-on faire du libre sans vision politique ?</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Suite &#224; sa campagne "D&#233;googlisons Internet" (oct 2014 - oct 2017), l'association a fait le bilan, calmement. Et il n'est pas brillant.

En quelques ann&#233;es, les GAFAM/BATX/NATU (Google, Apple, Facebook, Amazon, Microsoft, Baidu, Alibaba, Tencent, Xiaomi, Netflix, AirBnb, Tesla, Uber) ont "colonis&#233;" le monde, en formatant nos interactions, en normalisant nos relations, en orientant nos consommations, en contr&#244;lant notre pouvoir d'agir. &#192; l&#8217;&#339;uvre derri&#232;re cette m&#233;canique, une mutation &#233;conomique et sociale : le capitalisme de surveillance.

Avec sa nouvelle feuille de route "Contributopia", Framasoft souhaite mettre en place des outils et accompagner des dynamiques collectives qui permettraient de pouvoir agir, plut&#244;t que de subir. Il ne s'agit plus seulement de savoir &#171; ce que nous refusons &#187; (le logiciel propri&#233;taire, les attaques contre nos libert&#233;s fondamentales, etc), mais aussi de d&#233;finir &#171; quel monde nous souhaitons &#187;, et comment le logiciel libre et les communs peuvent nous aider &#224; y le mettre en &#339;uvre.

Nous essaierons donc de poser les faits qui d&#233;montrent que l'opensource se porte (tr&#232;s) bien mais que le logiciel libre (= opensource + valeurs + &#233;thique) soit dans une orni&#232;re depuis plusieurs ann&#233;es.

Pour sortir de l'orni&#232;re, mais aussi de l'&#233;puisement, ne devrions nous pas faire un pas de c&#244;t&#233; et r&#233;interroger les pratiques, les fonctionnements et les visions de nos communaut&#233;s libristes ? De ne plus voir le logiciel libre comme une fin en soi nous permettant de nous lib&#233;rer nous (libristes), mais comme un outil inspirant capable de favoriser l'&#233;mancipation de toutes et tous, et d&#8217;acc&#233;l&#233;rer des transformations sociales positives ?

La question politique a toujours &#233;t&#233; centrale dans le mouvement du logiciel libre, mais les questions &#233;conomiques, techniques et juridiques - elles aussi profond&#233;ment politiques, mais &#233;vitant soigneusement notre capacit&#233; d'avoir une vision globale - ont parfois pos&#233; un voile sur notre facult&#233; &#224; nous projeter ou &#224; passer de la r&#233;action &#224; l'action.

Et vous, comment imaginez la place du logiciel libre dans la soci&#233;t&#233; dans 3, 5 ou 10 ans ?</description><links /></event><event id="565"><persons /><person id="458">Capitole du Libre</person><tags /><start>16:00</start><duration>00:30</duration><room>B00</room><slug>conference-de-cloture</slug><title>Conf&#233;rence de cl&#244;ture</title><subtitle /><track /><type>keynote</type><language /><description>Petit r&#233;cap du Capitole du Libre 2018</description><links /></event><room name="B006-B007" /><event id="586"><persons /><person id="467">Framasoft</person><tags /><start>10:30</start><duration>02:00</duration><room>B006-B007</room><slug>contribatelier-4</slug><title>Contrib'atelier</title><subtitle /><track /><type>atelier</type><language /><description>Cette ann&#233;e Framasoft et d'autres structures ont organis&#233; des Contrib'ateliers dans quelques villes en France : Lyon, Toulouse, Nancy et Paris. L'id&#233;e est de rassembler des personnes de tous horizons, n'ayant pas n&#233;cessairement un bagage technique, pour am&#233;liorer les projets libres que nous utilisons au quotidien, et en inventer de nouveaux.

https://contribateliers.frama.site/

Nous proposons un contrib'atelier qui dure pendant tout le weekend du Capitole du Libre, &#224; partir du samedi apr&#232;s-midi, profitant de la pr&#233;sence des gens qui maintiennent des logiciels libres et qui ne manqueront pas de venir ce weekend, et leur offrir un espace leur permettant d'avancer sur leur projet avec les personnes venues contribuer au libre.

Cet atelier est dans la ligne de notre campagne Contributopia, dont l'objectif est de faciliter la contribution dans tous les domaines de la cr&#233;ation.

http://contributopia.org/</description><links /></event><event id="587"><persons /><person id="467">Framasoft</person><tags /><start>14:00</start><duration>01:30</duration><room>B006-B007</room><slug>contribatelier-5</slug><title>Contrib'atelier</title><subtitle /><track /><type>atelier</type><language /><description>Cette ann&#233;e Framasoft et d'autres structures ont organis&#233; des Contrib'ateliers dans quelques villes en France : Lyon, Toulouse, Nancy et Paris. L'id&#233;e est de rassembler des personnes de tous horizons, n'ayant pas n&#233;cessairement un bagage technique, pour am&#233;liorer les projets libres que nous utilisons au quotidien, et en inventer de nouveaux.

https://contribateliers.frama.site/

Nous proposons un contrib'atelier qui dure pendant tout le weekend du Capitole du Libre, &#224; partir du samedi apr&#232;s-midi, profitant de la pr&#233;sence des gens qui maintiennent des logiciels libres et qui ne manqueront pas de venir ce weekend, et leur offrir un espace leur permettant d'avancer sur leur projet avec les personnes venues contribuer au libre.

Cet atelier est dans la ligne de notre campagne Contributopia, dont l'objectif est de faciliter la contribution dans tous les domaines de la cr&#233;ation.

http://contributopia.org/</description><links /></event><room name="B104" /><event id="581"><persons /><person id="458">Capitole du Libre</person><tags /><start>10:30</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-9</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><event id="582"><persons /><person id="458">Capitole du Libre</person><tags /><start>14:00</start><duration>01:30</duration><room>B104</room><slug>atelier-installation-depannage-linux-10</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><room name="B207" /><event id="536"><persons /><person id="435">No&#235;l Mace</person><tags /><start>14:00</start><duration>02:00</duration><room>B207</room><slug>contribuer-a-un-projet-github-exemple-avec-angular</slug><title>Contribuer &#224; un projet Github : exemple avec Angular CLI</title><subtitle /><track>Web</track><type>atelier</type><language /><description>Vous avez toujours voulu contribuer &#224; un projet GitHub d'envergure, mais n'avez jamais vraiment su par o&#249; commencer ? Vous aimez le d&#233;veloppement web, les outils de dev et avez quelques bases en JavaScript / node.js ?

Vous vous &#234;tes au moins une fois pos&#233; l'une des questions suivantes :
- Quelles r&#232;gles doivent &#234;tre suivies sur ce projet pour contribuer ?
- Comment trouver un sujet &#224; traiter pour aider ce projet ?
- Comment proposer cette r&#233;solution de bug / cette nouvelle feature que je voudrais d&#233;velopper ?
- Comment aborder une base de code complexe ?

Cet atelier est pour vous !

Durant cet atelier, No&#235;l vous accompagnera dans votre compr&#233;hension et vos premi&#232;re contributions &#224; un projet mature avec pr&#234;t de 20 000 stars auquel il est lui m&#234;me contributeur depuis plusieurs ann&#233;es : Angular CLI.

De bonnes connaissances en JavaScript ainsi qu'un premier contact avec nodejs et git sont recommand&#233;s.

Si vous pr&#233;voyez d'assister &#224; cet atelier, nous vous encourageons vivement &#224; pr&#233;parer votre machine &#224; cet effet en amont afin de minimiser les probl&#232;mes.

Seront n&#233;cessaires :
- nodejs 10 https://nodejs.org/en/download/
- git https://git-scm.com/book/fr/v1/D&#233;marrage-rapide-Installation-de-Git
- yarn https://yarnpkg.com/lang/en/docs/install/
- chrome
- un IDE / editeur JavaScript (nous vous recommandons Visualiser Studio Code  https://code.visualstudio.com/docs/setup/setup-overview )
- cloner (git clone) github.com/angular/angular-cli-deep-dive sur votre machine
- vous rendre dans ce dossier et installer les d&#233;pendances via yarn
- cloner https://github.com/noelmace/angular-cli-deep-dive et installer les d&#233;pendances</description><links /></event><room name="B208" /><event id="515"><persons /><person id="422">Martin Carton</person><tags /><start>10:30</start><duration>02:00</duration><room>B208</room><slug>initiation-a-rust</slug><title>Initiation &#224; Rust</title><subtitle /><track>Technique</track><type>atelier</type><language /><description>Rust est un langage cr&#233;&#233; par Mozilla Research pour &#234;tre un langage s&#251;r, concurrent et pratique. C'est un langage compil&#233;, avec peu d'overhead, qui est un rempla&#231;ant moderne &#224; des langages comme C ou C++. Son typage fort et son unique borrow checker permettent d'&#233;viter beaucoup d'erreurs typiques du C ou C++.

Cet atelier sera une initiation aux diff&#233;rentes fonctionnalit&#233;s qui font de Rust un langage unique, &#224; base d'exemples simples.

Avoir pr&#233;-install&#233; le compilateur Rust ne sera pas n&#233;cessaire, l'atelier pourra &#234;tre effectu&#233; en utilisant le playgroung: https://play.rust-lang.org/.

Cet atelier pour vise les d&#233;butants. Connaitre Rust avant de venir n'est pas n&#233;cessaire, mais &#234;tre familier avec au moins un langage (que ce soit Python, C++, ou autre) est n&#233;cessaire. Avoir assist&#233; &#224; la pr&#233;sentation de Rust la veille est aussi une bonne id&#233;e pour avoir quelques notions de Rust.
Un laptop sera aussi n&#233;cessaire.</description><links /></event><event id="458"><persons /><person id="370">Nicolas Auvray</person><person id="371">Stanislas Dolcini</person><tags /><start>14:00</start><duration>01:00</duration><room>B208</room><slug>venez-jouer-a-0-ad-un-rts-dans-le-monde-antique</slug><title>Venez jouer &#224; 0 A.D., un RTS dans le monde antique !</title><subtitle /><track>Jeux Libres</track><type>atelier</type><language /><description>Venez d&#233;couvrir 0 A.D. au cours d'un atelier o&#249; nous installerons ensemble le jeu et jouerons quelques parties ! Amenez vos ordinateurs portables pour profiter au maximum de cet atelier ; pour celles et ceux n'ayant pas le leur, les parties que nous ferons seront tout de m&#234;me vid&#233;o-projet&#233;es.</description><links /></event><room name="B306" /><event id="544"><persons /><person id="443">oxyta.net</person><tags /><start>10:30</start><duration>02:00</duration><room>B306</room><slug>lancez-votre-chatons-grace-a-traefik-en-quelques-d</slug><title>Lancez votre CHATONS gr&#226;ce &#224; Traefik en quelques "docker-compose up"</title><subtitle /><track>DevOps</track><type>atelier</type><language /><description>Dans cet atelier, le CHATONS toulousain oxyta.net vous montrera ses recettes pour lancer rapidement des services comme nextcloud, gitlab, etherpad, peertube et matrix sur votre machine de dev.

 Et si vous avez votre propre serveur, vous pourrez facilement et rapidement passer &#224; un environement de production sans m&#234;me que ces services ne s&#8217;en rendent compte !

L&#8217;atelier s&#8217;appuie sur quelques recettes docker-compose minimalistes, comprenant diverses configurations possibles du reverse proxy traefik.

Pr&#233;requis:&#160;on ordinateur avec docker &amp; docker-compose.
un docker registry local sera mis en place pour d&#233;charger le r&#233;seau.</description><links /></event><event id="588"><persons /><person id="352">Denis Dordoigne</person><tags /><start>14:00</start><duration>02:00</duration><room>B306</room><slug>degooglisation-dun-telephone-android</slug><title>D&#233;googlisation d'un t&#233;l&#233;phone Android</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>atelier</type><language /><description>&#192; partir d'un t&#233;l&#233;phone android standard, nous remplacerons un maximum de logiciels par des logiciels libres, et un maximum de services par des services Chatons (collectif des h&#233;bergeurs alternatifs, transparents, ouverts neutres et solidaires). Cela se fera sans perte de donn&#233;es et sans devoir contourner les syst&#232;mes de s&#233;curit&#233; impos&#233;s par le fabriquant et/ou l'op&#233;rateur.

Pr&#233;-requis : 
- avoir un t&#233;l&#233;phone android (ou tout autre OS d&#233;riv&#233; de AOSP)
- avoir assist&#233; &#224; la conf&#233;rence &#171; vers un t&#233;l&#233;phone sans GAFAM &#187; est conseill&#233; mais pas n&#233;cessaire
- il sera possible de le faire sur place, mais il serait pr&#233;f&#233;rable d'avoir ouvert un compte chez un des Chatons proposant des services dans le cloud (liste disponible sur le stand Framasoft/chatons)</description><links /></event><room name="B307" /><event id="537"><persons /><person id="435">No&#235;l Mace</person><person id="436">Weber Rudy</person><tags /><start>10:30</start><duration>02:00</duration><room>B307</room><slug>initiation-a-reasonml</slug><title>Initiation &#224; ReasonML</title><subtitle /><track>Web</track><type>atelier</type><language /><description>Vous &#234;tes convaincus des avantages de TypeScript ou Flow mais vous &#234;tes frustr&#233;s de leurs limites ? Cet atelier est fait pour vous !

ReasonML est un dialecte de OCaml, cr&#233;&#233; par Jordan Walke (le cr&#233;ateur de React), d&#233;velopp&#233; par une petite &#233;quipe chez Facebook et une communaut&#233; enthousiaste. Le but est de faciliter l'acc&#232;s au syst&#232;me de type avanc&#233; et &#224; l'expressivit&#233; de OCaml en lui donnant une syntaxe proche de JavaScript, une toolchain commune et une interop&#233;rabilit&#233; trivialement simple.

Si ReasonML vous permet aussi de compiler vers du code natif, cet atelier sera centr&#233; autour de la compilation vers JavaScript. Venez pr&#233;par&#233;s ! Suivez les instructions d'installation de la plateforme et du support de votre IDE pr&#233;f&#233;r&#233; sur https://reasonml.github.io/</description><links /></event><event id="568"><persons /><person id="457">Adrien Blind</person><person id="474">Ludovic Piot</person><person id="475">Laurent Grangeau</person><tags /><start>14:00</start><duration>02:00</duration><room>B307</room><slug>debuter-le-serverless-avec-openfaas</slug><title>D&#233;buter le serverless avec OpenFaaS</title><subtitle /><track>DevOps</track><type>atelier</type><language /><description>D&#233;ployez votre infrastructure serverless avec Docker, Kubernetes et OpenFaaS.</description><links /></event><room name="B308" /><event id="498"><persons /><person id="408">Mathias Fontmarty</person><tags /><start>10:30</start><duration>02:00</duration><room>B308</room><slug>creation-dasset-3d-pour-le-jeu-video-avec-blender-</slug><title>Cr&#233;ation d'asset 3D pour le jeu vid&#233;o avec Blender et Krita</title><subtitle /><track>3D</track><type>atelier</type><language /><description>Venez apprendre &#224; cr&#233;er quelques objets cartoons simples (mur, arbre, jarre, oiseau... &#224; voir en fonction des envies du public :p) pr&#234;ts &#224; &#234;tre int&#233;gr&#233;s dans un jeu vid&#233;o. Mod&#233;lisation dans Blender et texturing dans Krita.

Une connaissance basique des logiciels sera n&#233;cessaire notamment: 
- pour Blender: naviguer dans la vue 3D, selections, mode objet/edit 
- pour Krita: cr&#233;er un nouveau document, utiliser des brosses, choisir une couleur 

Afin de profiter au maximum de cet atelier, une tablette graphique est fortement recommand&#233;e pour la partie texture dans Krita.</description><links /></event><room name="C002" /><event id="491"><persons /><person id="404">Bram</person><tags /><start>10:30</start><duration>01:00</duration><room>C002</room><slug>yunohost-un-des-chemins-vers-la-decentralisation</slug><title>YunoHost: un des chemins vers la d&#233;centralisation</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>YunoHost est un outil cherchant &#224; rendre accessible l'administration d'un serveur &#224; un public de plus en plus large, et donc de faciliter l'auto-h&#233;bergement, de la m&#234;me mani&#232;re que les interfaces de bureau ont rendu accessible l'utilisation d'un ordinateur.

Dans un monde qui m&#234;le capitalisme de surveillance et de l'attention d'une part, et surveillance d'&#233;tat g&#233;n&#233;ralis&#233;e d'autre part, la centralisation d'internet s'accentue, et des attaques de plus en plus intenses siont lanc&#233;es chaques semaines sur la vie priv&#233;e. En parall&#232;le, nos communaut&#233;s s'activent &#224; construire et &#224; proposer des alternatives pour b&#226;tir une autre voie.

Cette conf&#233;rence vous expliquera ce cadre, l'importance d'y construire des alternatives et comment YunoHost s'inscrit dans ce combat politique tout en se combinant, voir en permettant, &#224; d'autres alternatives de voir le jour, car au-del&#224; du rempla&#231;ant, c'est &#224; nous de construire ce qu'ils ne peuvent pas faire. Elle vous expliquera &#233;galement ce que YunoHost peut faire et en quoi cela peut vous &#234;tes utile.</description><links /></event><event id="516"><persons /><person id="423">Elzen</person><tags /><start>11:30</start><duration>01:00</duration><room>C002</room><slug>le-bon-la-brute-et-le-truand-des-internets</slug><title>Le bon, la brute et le truand des Internets</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Et si on vous racontait Internet &#224; la fa&#231;on d'un film de Sergio Leone&#8239;? Le pire, c'est que &#231;a marche plut&#244;t pas trop mal pour expliquer un certain nombre de choses, tant au niveau technique qu'au niveau des enjeux. Alors pr&#233;voyez vos colts, vos stetsons et vos &#233;perons&#8239;: on va aller faire un tour dans l'ouest. L'ouest du r&#233;seau, naturellement.</description><links /></event><event id="505"><persons /><person id="415">Thierry Stoehr</person><tags /><start>14:00</start><duration>01:00</duration><room>C002</room><slug>le-papier-un-vrai-outil-digital-et-un-vrai-danger-</slug><title>Le papier : un vrai outil digital et un vrai danger pour le num&#233;rique</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Les 42 raisons qui prouvent que l'outil papier est subversif, voire dangereux, et qui ne peuvent que provoquer sa restriction d'utilisation, voire son interdiction.</description><links /></event><room name="C102" /><event id="575"><persons /><person id="466">Combustible</person><tags /><start>14:00</start><duration>01:30</duration><room>C102</room><slug>atelier-junior</slug><title>Atelier Junior</title><subtitle /><track /><type>atelier</type><language /><description>Ateliers  d'Impression 3D, de robotique, de r&#233;alit&#233; virtuelle et de montage d&#233;montage d'un ordi... qu'avec du logiciel libre.</description><links /></event><room name="Foyer &#201;tudiants" /><event id="570"><persons /><person id="458">Capitole du Libre</person><tags /><start>12:30</start><duration>01:30</duration><room>Foyer &#201;tudiants</room><slug>pause-dejeuner-4</slug><title>Pause d&#233;jeuner</title><subtitle /><track /><type>keynote</type><language /><description>Pause d&#233;jeuner</description><links /></event></day></schedule>